zephyrproject-rtos/hal_stm32/stm32cube/stm32u3xx/soc/stm32u3a6xx.h
/**
  * @brief Improved Inter-integrated Circuit Interface
  */
typedef struct
{
  __IO uint32_t CR;             /*!< I3C Control register,                      Address offset: 0x00      */
  __IO uint32_t CFGR;           /*!< I3C Controller Configuration register,     Address offset: 0x04      */
  uint32_t      RESERVED1[2];   /*!< Reserved,                                  Address offset: 0x08-0x0C */
  __IO uint32_t RDR;            /*!< I3C Received Data register,                Address offset: 0x10      */
  __IO uint32_t RDWR;           /*!< I3C Received Data Word register,           Address offset: 0x14      */
  __IO uint32_t TDR;            /*!< I3C Transmit Data register,                Address offset: 0x18      */
  __IO uint32_t TDWR;           /*!< I3C Transmit Data Word register,           Address offset: 0x1C      */
  __IO uint32_t IBIDR;          /*!< I3C IBI payload Data register,             Address offset: 0x20      */
  __IO uint32_t TGTTDR;         /*!< I3C Target Transmit register,              Address offset: 0x24      */
  uint32_t      RESERVED2[2];   /*!< Reserved,                                  Address offset: 0x28-0x2C */
  __IO uint32_t SR;             /*!< I3C Status register,                       Address offset: 0x30      */
  __IO uint32_t SER;            /*!< I3C Status Error register,                 Address offset: 0x34      */
  uint32_t      RESERVED3[2];   /*!< Reserved,                                  Address offset: 0x38-0x3C */
  __IO uint32_t RMR;            /*!< I3C Received Message register,             Address offset: 0x40      */
  uint32_t      RESERVED4[3];   /*!< Reserved,                                  Address offset: 0x44-0x4C */
  __IO uint32_t EVR;            /*!< I3C Event register,                        Address offset: 0x50      */
  __IO uint32_t IER;            /*!< I3C Interrupt Enable register,             Address offset: 0x54      */
  __IO uint32_t CEVR;           /*!< I3C Clear Event register,                  Address offset: 0x58      */
  __IO uint32_t MISR;           /*!< I3C Masked Interrupt Status register,      Address offset: 0x5C      */
  __IO uint32_t DEVR0;          /*!< I3C own Target characteristics register,   Address offset: 0x60      */
  __IO uint32_t DEVRX[4];       /*!< I3C Target x (1<=x<=4) register,           Address offset: 0x64-0x70 */
  uint32_t      RESERVED6[7];   /*!< Reserved,                                  Address offset: 0x74-0x8C */
  __IO uint32_t MAXRLR;         /*!< I3C Maximum Read Length register,          Address offset: 0x90      */
  __IO uint32_t MAXWLR;         /*!< I3C Maximum Write Length register,         Address offset: 0x94      */
  uint32_t      RESERVED7[2];   /*!< Reserved,                                  Address offset: 0x98-0x9C */
  __IO uint32_t TIMINGR0;       /*!< I3C Timing 0 register,                     Address offset: 0xA0      */
  __IO uint32_t TIMINGR1;       /*!< I3C Timing 1 register,                     Address offset: 0xA4      */
  __IO uint32_t TIMINGR2;       /*!< I3C Timing 2 register,                     Address offset: 0xA8      */
  uint32_t      RESERVED9[5];   /*!< Reserved,                                  Address offset: 0xAC-0xBC */
  __IO uint32_t BCR;            /*!< I3C Bus Characteristics register,          Address offset: 0xC0      */
  __IO uint32_t DCR;            /*!< I3C Device Characteristics register,       Address offset: 0xC4      */
  __IO uint32_t GETCAPR;        /*!< I3C GET CAPabilities register,             Address offset: 0xC8      */
  __IO uint32_t CRCAPR;         /*!< I3C Controller CAPabilities register,      Address offset: 0xCC      */
  __IO uint32_t GETMXDSR;       /*!< I3C GET Max Data Speed register,           Address offset: 0xD0      */
  __IO uint32_t EPIDR;          /*!< I3C Extended Provisioned ID register,      Address offset: 0xD4      */
} I3C_TypeDef;

/**
  * @brief Instruction Cache
  */
typedef struct
{
  __IO uint32_t CR;               /*!< ICACHE control register,                Address offset: 0x00 */
  __IO uint32_t SR;               /*!< ICACHE status register,                 Address offset: 0x04 */
  __IO uint32_t IER;              /*!< ICACHE interrupt enable register,       Address offset: 0x08 */
  __IO uint32_t FCR;              /*!< ICACHE Flag clear register,             Address offset: 0x0C */
  __IO uint32_t HMONR;            /*!< ICACHE hit monitor register,            Address offset: 0x10 */
  __IO uint32_t MMONR;            /*!< ICACHE miss monitor register,           Address offset: 0x14 */
       uint32_t RESERVED1[2];     /*!< Reserved,                                        0x018-0x01C */
  __IO uint32_t CRR0;             /*!< ICACHE region 0 configuration register, Address offset: 0x20 */
  __IO uint32_t CRR1;             /*!< ICACHE region 1 configuration register, Address offset: 0x24 */
  __IO uint32_t CRR2;             /*!< ICACHE region 2 configuration register, Address offset: 0x28 */
  __IO uint32_t CRR3;             /*!< ICACHE region 3 configuration register, Address offset: 0x2C */
} ICACHE_TypeDef;

/**
  * @brief IWDG
  */
typedef struct
{
  __IO uint32_t KR;               /*!< IWDG Key register,          Address offset: 0x00 */
  __IO uint32_t PR;               /*!< IWDG Prescaler register,    Address offset: 0x04 */
  __IO uint32_t RLR;              /*!< IWDG Reload register,       Address offset: 0x08 */
  __IO uint32_t SR;               /*!< IWDG Status register,       Address offset: 0x0C */
  __IO uint32_t WINR;             /*!< IWDG Window register,       Address offset: 0x10 */
  __IO uint32_t EWCR;             /*!< IWDG Early Wakeup register, Address offset: 0x14 */
} IWDG_TypeDef;

/**
  * @brief LCD
  */
typedef struct
{
  __IO uint32_t CR;          /*!< LCD control register,              Address offset: 0x00 */
  __IO uint32_t FCR;         /*!< LCD frame control register,        Address offset: 0x04 */
  __IO uint32_t SR;          /*!< LCD status register,               Address offset: 0x08 */
  __IO uint32_t CLR;         /*!< LCD clear register,                Address offset: 0x0C */
  uint32_t RESERVED;         /*!< Reserved,                          Address offset: 0x10 */
  __IO uint32_t RAM[16];     /*!< LCD display memory,           Address offset: 0x14-0x50 */
} LCD_TypeDef;

/**
  * @brief LPTIMER
  */
typedef struct
{
  __IO uint32_t ISR;              /*!< LPTIM Interrupt and Status register,    Address offset: 0x00 */
  __IO uint32_t ICR;              /*!< LPTIM Interrupt Clear register,         Address offset: 0x04 */
  __IO uint32_t DIER;             /*!< LPTIM Interrupt Enable register,        Address offset: 0x08 */
  __IO uint32_t CFGR;             /*!< LPTIM Configuration register,           Address offset: 0x0C */
  __IO uint32_t CR;               /*!< LPTIM Control register,                 Address offset: 0x10 */
  __IO uint32_t CCR1;             /*!< LPTIM Capture/Compare register 1,       Address offset: 0x14 */
  __IO uint32_t ARR;              /*!< LPTIM Autoreload register,              Address offset: 0x18 */
  __IO uint32_t CNT;              /*!< LPTIM Counter register,                 Address offset: 0x1C */
  __IO uint32_t RESERVED0;        /*!< Reserved,                               Address offset: 0x20 */
  __IO uint32_t CFGR2;            /*!< LPTIM Configuration register 2,         Address offset: 0x24 */
  __IO uint32_t RCR;              /*!< LPTIM Repetition register,              Address offset: 0x28 */
  __IO uint32_t CCMR1;            /*!< LPTIM Capture/Compare mode register,    Address offset: 0x2C */
  __IO uint32_t RESERVED1;        /*!< Reserved,                               Address offset: 0x30 */
  __IO uint32_t CCR2;             /*!< LPTIM Capture/Compare register 2,       Address offset: 0x34 */
} LPTIM_TypeDef;

/**
  * @brief MDF/ADF
  */
typedef struct
{
  __IO uint32_t GCR;              /*!< MDF Global Control register,            Address offset: 0x00  */
  __IO uint32_t CKGCR;            /*!< MDF Clock Generator Control Register,   Address offset: 0x04  */
 uint32_t       RESERVED0[6];     /*!< Reserved, 0x08-0x1C                                           */
  __IO uint32_t TRGISELR;         /*!< MDF Trigger Input Selection Register,   Address offset: 0x20  */
} MDF_TypeDef;

/**
  * @brief MDF/ADF filter
  */
typedef struct
{
 __IO uint32_t SITFCR;            /*!< MDF Serial Interface Control Register,          Address offset: 0x80 */
 __IO uint32_t BSMXCR;            /*!< MDF Bitstream Matrix Control Register,          Address offset: 0x84 */
 __IO uint32_t DFLTCR;            /*!< MDF Digital Filter Control Register,            Address offset: 0x88 */
 __IO uint32_t DFLTCICR;          /*!< MDF MCIC Configuration Register,                Address offset: 0x8C */
 __IO uint32_t DFLTRSFR;          /*!< MDF Reshape Filter Configuration Register,      Address offset: 0x90 */
 uint32_t      RESERVED0[4];      /*!< Reserved, 0x94-0xA0                                                  */
 __IO uint32_t DLYCR;             /*!< MDF Delay control Register,                     Address offset: 0xA4 */
 uint32_t      RESERVED1[1];      /*!< Reserved, 0xA8                                                       */
 __IO uint32_t DFLTIER;           /*!< MDF DFLT Interrupt enable Register,             Address offset: 0xAC */
 __IO uint32_t DFLTISR;           /*!< MDF DFLT Interrupt status Register,             Address offset: 0xB0 */
 uint32_t      RESERVED2[1];      /*!< Reserved, 0xB4                                                       */
 __IO uint32_t SADCR;             /*!< MDF SAD Control Register,                       Address offset: 0xB8 */
 __IO uint32_t SADCFGR;           /*!< MDF SAD configuration register,                 Address offset: 0xBC */
 __IO uint32_t SADSDLVR;          /*!< MDF SAD Sound level Register,                   Address offset: 0xC0 */
 __IO uint32_t SADANLVR;          /*!< MDF SAD Ambient Noise level Register,           Address offset: 0xC4 */
 uint32_t      RESERVED3[10];     /*!< Reserved, 0xC8-0xEC                                                  */
 __IO uint32_t DFLTDR;            /*!< MDF Digital Filter Data Register,               Address offset: 0xF0 */
} MDF_Filter_TypeDef;

/**
  * @brief Operational Amplifier (OPAMP)
  */
typedef struct
{
  __IO uint32_t CSR;              /*!< OPAMP control/status register,                     Address offset: 0x00 */
  __IO uint32_t OTR;              /*!< OPAMP offset trimming register for normal mode,    Address offset: 0x04 */
  __IO uint32_t LPOTR;            /*!< OPAMP offset trimming register for low power mode, Address offset: 0x08 */
} OPAMP_TypeDef;

typedef struct
{
  __IO uint32_t CSR;              /*!< OPAMP control/status register, used for bits common to
                                    several OPAMP instances, Address offset: 0x00         */
} OPAMP_Common_TypeDef;

/**
  * @brief PKA
  */
typedef struct
{
  __IO uint32_t CR;               /*!< PKA control register,             Address offset: 0x00 */
  __IO uint32_t SR;               /*!< PKA status register,              Address offset: 0x04 */
  __IO uint32_t CLRFR;            /*!< PKA clear flag register,          Address offset: 0x08 */
  uint32_t Reserved[253];         /*!< Reserved memory area              Address offset: 0x0C  -> 0x03FC */
  __IO uint32_t RAM[1334];        /*!< PKA RAM                           Address offset: 0x400 -> 0x18D4 */
} PKA_TypeDef;

/**
  * @brief Power Control
  */
typedef struct
{
  __IO uint32_t CR1;              /*!< Power control register 1,                          Address offset: 0x00 */
  __IO uint32_t CR2;              /*!< Power control register 2,                          Address offset: 0x04 */
  __IO uint32_t CR3;              /*!< Power control register 3,                          Address offset: 0x08 */
  __IO uint32_t VOSR;             /*!< Power voltage scaling register,                    Address offset: 0x0C */
  __IO uint32_t SVMCR;            /*!< Power supply voltage monitoring control register,  Address offset: 0x10 */
  __IO uint32_t WUCR1;            /*!< Power wakeup control register 1,                   Address offset: 0x14 */
  __IO uint32_t WUCR2;            /*!< Power wakeup control register 2,                   Address offset: 0x18 */
  __IO uint32_t WUCR3;            /*!< Power wakeup control register 3,                   Address offset: 0x1C */
  uint32_t      RESERVED1;        /*!< Reserved,                                          Address offset: 0x20 */
  __IO uint32_t BDCR;             /*!< Power backup domain control register,              Address offset: 0x24 */
  __IO uint32_t DBPR;             /*!< Power disable backup domain register,              Address offset: 0x28 */
  uint32_t      RESERVED2;        /*!< Reserved,                                          Address offset: 0x2C */
  __IO uint32_t SECCFGR;          /*!< Power Security configuration register,             Address offset: 0x30 */
  __IO uint32_t PRIVCFGR;         /*!< Power privilege control register,                  Address offset: 0x34 */
  __IO uint32_t SR;               /*!< Power status register,                             Address offset: 0x38 */
  __IO uint32_t SVMSR;            /*!< Power supply voltage monitoring status register,   Address offset: 0x3C */
  uint32_t      RESERVED3;        /*!< Reserved,                                          Address offset: 0x20 */
  __IO uint32_t WUSR;             /*!< Power wakeup status register,                      Address offset: 0x44 */
  __IO uint32_t WUSCR;            /*!< Power wakeup status clear register,                Address offset: 0x48 */
  __IO uint32_t APCR;             /*!< Power apply pull configuration register,           Address offset: 0x4C */
  __IO uint32_t PUCRA;            /*!< Power Port A pull-up control register,             Address offset: 0x50 */
  __IO uint32_t PDCRA;            /*!< Power Port A pull-down control register,           Address offset: 0x54 */
  __IO uint32_t PUCRB;            /*!< Power Port B pull-up control register,             Address offset: 0x58 */
  __IO uint32_t PDCRB;            /*!< Power Port B pull-down control register,           Address offset: 0x5C */
  __IO uint32_t PUCRC;            /*!< Power Port C pull-up control register,             Address offset: 0x60 */
  __IO uint32_t PDCRC;            /*!< Power Port C pull-down control register,           Address offset: 0x64 */
  __IO uint32_t PUCRD;            /*!< Power Port D pull-up control register,             Address offset: 0x68 */
  __IO uint32_t PDCRD;            /*!< Power Port D pull-down control register,           Address offset: 0x6C */
  __IO uint32_t PUCRE;            /*!< Power Port E pull-up control register,             Address offset: 0x70 */
  __IO uint32_t PDCRE;            /*!< Power Port E pull-down control register,           Address offset: 0x74 */
  __IO uint32_t PUCRF;            /*!< Power Port F pull-up control register,             Address offset: 0x78 */
  __IO uint32_t PDCRF;            /*!< Power Port F pull-down control register,           Address offset: 0x7C */
  __IO uint32_t PUCRG;            /*!< Power Port G pull-up control register,             Address offset: 0x80 */
  __IO uint32_t PDCRG;            /*!< Power Port G pull-down control register,           Address offset: 0x84 */
  __IO uint32_t PUCRH;            /*!< Power Port H pull-up control register,             Address offset: 0x88 */
  __IO uint32_t PDCRH;            /*!< Power Port H pull-down control register,           Address offset: 0x8C */
  uint32_t      RESERVED5[8];     /*!< Reserved,                                          Address offset: 0x90 -> 0xAC */
  __IO uint32_t I3CPUCR1;         /*!< Power I3C pull-up control register 1,              Address offset: 0xB0 */
  __IO uint32_t I3CPUCR2;         /*!< Power I3C pull-up control register 2,              Address offset: 0xB4 */
} PWR_TypeDef;

/**
  * @brief SRAMs configuration controller
  */
typedef struct
{
  __IO uint32_t CR;           /*!< Control Register,                  Address offset: 0x00 */
  __IO uint32_t IER;          /*!< Interrupt enable register,         Address offset: 0x04 */
  __IO uint32_t ISR;          /*!< Interrupt status register,         Address offset: 0x08 */
  uint32_t      RESERVED0;    /*!< Reserved,                          Address offset: 0x0C */
  __IO uint32_t PEAR;         /*!< Parity error address register,     Address offset: 0x10 */
  __IO uint32_t ICR;          /*!< Interrupt clear register,          Address offset: 0x14 */
  __IO uint32_t WPR1;         /*!< Write protection register 1,       Address offset: 0x18 */
  __IO uint32_t WPR2;         /*!< Write protection register 2,       Address offset: 0x1C */
  uint32_t      RESERVED1;    /*!< Reserved,                          Address offset: 0x20 */
  __IO uint32_t PARKEYR;      /*!< Parity key register,               Address offset: 0x24 */
  __IO uint32_t ERKEYR;       /*!< Erase key register,                Address offset: 0x28 */
}RAMCFG_TypeDef;

