zephyrproject-rtos/hal_stm32/stm32cube/stm32u3xx/soc/stm32u3a6xx.h
#define ADC_AWD1HTR_AWDFILT_Pos             (29UL)
#define ADC_AWD1HTR_AWDFILT_Msk             (0x7UL << ADC_AWD1HTR_AWDFILT_Pos)      /*!< 0x00000007 */
#define ADC_AWD1HTR_AWDFILT                 ADC_AWD1HTR_AWDFILT_Msk                 /*!< ADC analog watchdog 1 filtering */
#define ADC_AWD1HTR_AWDFILT_0               (0x000001UL << ADC_AWD1HTR_AWDFILT_Pos) /*!< 0x00000001 */
#define ADC_AWD1HTR_AWDFILT_1               (0x000002UL << ADC_AWD1HTR_AWDFILT_Pos) /*!< 0x00000002 */
#define ADC_AWD1HTR_AWDFILT_2               (0x000004UL << ADC_AWD1HTR_AWDFILT_Pos) /*!< 0x00000004 */

/********************  Bit definition for ADC_AWD2TR_LT register  *******************/
#define ADC_AWD2LTR_LTR_Pos                 (0UL)
#define ADC_AWD2LTR_LTR_Msk                 (0x007FFFFFUL << ADC_AWD2LTR_LTR_Pos)   /*!< 0x007FFFFF */
#define ADC_AWD2LTR_LTR                     ADC_AWD2LTR_LTR_Msk                     /*!< ADC analog watchdog 2 threshold low */
#define ADC_AWD2LTR_LTR_0                   (0x000001UL << ADC_AWD2LTR_LTR_Pos)     /*!< 0x00000001 */
#define ADC_AWD2LTR_LTR_1                   (0x000002UL << ADC_AWD2LTR_LTR_Pos)     /*!< 0x00000002 */
#define ADC_AWD2LTR_LTR_2                   (0x000004UL << ADC_AWD2LTR_LTR_Pos)     /*!< 0x00000004 */
#define ADC_AWD2LTR_LTR_3                   (0x000008UL << ADC_AWD2LTR_LTR_Pos)     /*!< 0x00000008 */
#define ADC_AWD2LTR_LTR_4                   (0x000010UL << ADC_AWD2LTR_LTR_Pos)     /*!< 0x00000010 */
#define ADC_AWD2LTR_LTR_5                   (0x000020UL << ADC_AWD2LTR_LTR_Pos)     /*!< 0x00000020 */
#define ADC_AWD2LTR_LTR_6                   (0x000040UL << ADC_AWD2LTR_LTR_Pos)     /*!< 0x00000040 */
#define ADC_AWD2LTR_LTR_7                   (0x000080UL << ADC_AWD2LTR_LTR_Pos)     /*!< 0x00000080 */
#define ADC_AWD2LTR_LTR_8                   (0x000100UL << ADC_AWD2LTR_LTR_Pos)     /*!< 0x00000100 */
#define ADC_AWD2LTR_LTR_9                   (0x000200UL << ADC_AWD2LTR_LTR_Pos)     /*!< 0x00000200 */
#define ADC_AWD2LTR_LTR_10                  (0x000400UL << ADC_AWD2LTR_LTR_Pos)     /*!< 0x00000400 */
#define ADC_AWD2LTR_LTR_11                  (0x000800UL << ADC_AWD2LTR_LTR_Pos)     /*!< 0x00000800 */
#define ADC_AWD2LTR_LTR_12                  (0x001000UL << ADC_AWD2LTR_LTR_Pos)     /*!< 0x00001000 */
#define ADC_AWD2LTR_LTR_13                  (0x002000UL << ADC_AWD2LTR_LTR_Pos)     /*!< 0x00002000 */
#define ADC_AWD2LTR_LTR_14                  (0x004000UL << ADC_AWD2LTR_LTR_Pos)     /*!< 0x00004000 */
#define ADC_AWD2LTR_LTR_15                  (0x008000UL << ADC_AWD2LTR_LTR_Pos)     /*!< 0x00008000 */
#define ADC_AWD2LTR_LTR_16                  (0x010000UL << ADC_AWD2LTR_LTR_Pos)     /*!< 0x00010000 */
#define ADC_AWD2LTR_LTR_17                  (0x020000UL << ADC_AWD2LTR_LTR_Pos)     /*!< 0x00020000 */
#define ADC_AWD2LTR_LTR_18                  (0x040000UL << ADC_AWD2LTR_LTR_Pos)     /*!< 0x00040000 */
#define ADC_AWD2LTR_LTR_19                  (0x080000UL << ADC_AWD2LTR_LTR_Pos)     /*!< 0x00080000 */
#define ADC_AWD2LTR_LTR_20                  (0x100000UL << ADC_AWD2LTR_LTR_Pos)     /*!< 0x00100000 */
#define ADC_AWD2LTR_LTR_21                  (0x200000UL << ADC_AWD2LTR_LTR_Pos)     /*!< 0x00200000 */
#define ADC_AWD2LTR_LTR_22                  (0x400000UL << ADC_AWD2LTR_LTR_Pos)     /*!< 0x00400000 */

/********************  Bit definition for ADC_AWD2TR_HT register  *******************/
#define ADC_AWD2HTR_HTR_Pos                 (0UL)
#define ADC_AWD2HTR_HTR_Msk                 (0x007FFFFFUL << ADC_AWD2HTR_HTR_Pos)   /*!< 0x007FFFFF */
#define ADC_AWD2HTR_HTR                     ADC_AWD2HTR_HTR_Msk                     /*!< ADC analog watchdog 2 threshold high */
#define ADC_AWD2HTR_HTR_0                   (0x000001UL << ADC_AWD2HTR_HTR_Pos)     /*!< 0x00000001 */
#define ADC_AWD2HTR_HTR_1                   (0x000002UL << ADC_AWD2HTR_HTR_Pos)     /*!< 0x00000002 */
#define ADC_AWD2HTR_HTR_2                   (0x000004UL << ADC_AWD2HTR_HTR_Pos)     /*!< 0x00000004 */
#define ADC_AWD2HTR_HTR_3                   (0x000008UL << ADC_AWD2HTR_HTR_Pos)     /*!< 0x00000008 */
#define ADC_AWD2HTR_HTR_4                   (0x000010UL << ADC_AWD2HTR_HTR_Pos)     /*!< 0x00000010 */
#define ADC_AWD2HTR_HTR_5                   (0x000020UL << ADC_AWD2HTR_HTR_Pos)     /*!< 0x00000020 */
#define ADC_AWD2HTR_HTR_6                   (0x000040UL << ADC_AWD2HTR_HTR_Pos)     /*!< 0x00000040 */
#define ADC_AWD2HTR_HTR_7                   (0x000080UL << ADC_AWD2HTR_HTR_Pos)     /*!< 0x00000080 */
#define ADC_AWD2HTR_HTR_8                   (0x000100UL << ADC_AWD2HTR_HTR_Pos)     /*!< 0x00000100 */
#define ADC_AWD2HTR_HTR_9                   (0x000200UL << ADC_AWD2HTR_HTR_Pos)     /*!< 0x00000200 */
#define ADC_AWD2HTR_HTR_10                  (0x000400UL << ADC_AWD2HTR_HTR_Pos)     /*!< 0x00000400 */
#define ADC_AWD2HTR_HTR_11                  (0x000800UL << ADC_AWD2HTR_HTR_Pos)     /*!< 0x00000800 */
#define ADC_AWD2HTR_HTR_12                  (0x001000UL << ADC_AWD2HTR_HTR_Pos)     /*!< 0x00001000 */
#define ADC_AWD2HTR_HTR_13                  (0x002000UL << ADC_AWD2HTR_HTR_Pos)     /*!< 0x00002000 */
#define ADC_AWD2HTR_HTR_14                  (0x004000UL << ADC_AWD2HTR_HTR_Pos)     /*!< 0x00004000 */
#define ADC_AWD2HTR_HTR_15                  (0x008000UL << ADC_AWD2HTR_HTR_Pos)     /*!< 0x00008000 */
#define ADC_AWD2HTR_HTR_16                  (0x010000UL << ADC_AWD2HTR_HTR_Pos)     /*!< 0x00010000 */
#define ADC_AWD2HTR_HTR_17                  (0x020000UL << ADC_AWD2HTR_HTR_Pos)     /*!< 0x00020000 */
#define ADC_AWD2HTR_HTR_18                  (0x040000UL << ADC_AWD2HTR_HTR_Pos)     /*!< 0x00040000 */
#define ADC_AWD2HTR_HTR_19                  (0x080000UL << ADC_AWD2HTR_HTR_Pos)     /*!< 0x00080000 */
#define ADC_AWD2HTR_HTR_20                  (0x100000UL << ADC_AWD2HTR_HTR_Pos)     /*!< 0x00100000 */
#define ADC_AWD2HTR_HTR_21                  (0x200000UL << ADC_AWD2HTR_HTR_Pos)     /*!< 0x00200000 */
#define ADC_AWD2HTR_HTR_22                  (0x400000UL << ADC_AWD2HTR_HTR_Pos)     /*!< 0x00400000 */

