zephyrproject-rtos/hal_stm32/stm32cube/stm32u3xx/soc/stm32u3a6xx.h
/********************  Bit definition for ADC_AWD3TR_LT register  *******************/
#define ADC_AWD3LTR_LTR_Pos                 (0UL)
#define ADC_AWD3LTR_LTR_Msk                 (0x007FFFFFUL << ADC_AWD3LTR_LTR_Pos)   /*!< 0x007FFFFF */
#define ADC_AWD3LTR_LTR                     ADC_AWD3LTR_LTR_Msk                     /*!< ADC analog watchdog 3 threshold low */
#define ADC_AWD3LTR_LTR_0                   (0x000001UL << ADC_AWD3LTR_LTR_Pos)     /*!< 0x00000001 */
#define ADC_AWD3LTR_LTR_1                   (0x000002UL << ADC_AWD3LTR_LTR_Pos)     /*!< 0x00000002 */
#define ADC_AWD3LTR_LTR_2                   (0x000004UL << ADC_AWD3LTR_LTR_Pos)     /*!< 0x00000004 */
#define ADC_AWD3LTR_LTR_3                   (0x000008UL << ADC_AWD3LTR_LTR_Pos)     /*!< 0x00000008 */
#define ADC_AWD3LTR_LTR_4                   (0x000010UL << ADC_AWD3LTR_LTR_Pos)     /*!< 0x00000010 */
#define ADC_AWD3LTR_LTR_5                   (0x000020UL << ADC_AWD3LTR_LTR_Pos)     /*!< 0x00000020 */
#define ADC_AWD3LTR_LTR_6                   (0x000040UL << ADC_AWD3LTR_LTR_Pos)     /*!< 0x00000040 */
#define ADC_AWD3LTR_LTR_7                   (0x000080UL << ADC_AWD3LTR_LTR_Pos)     /*!< 0x00000080 */
#define ADC_AWD3LTR_LTR_8                   (0x000100UL << ADC_AWD3LTR_LTR_Pos)     /*!< 0x00000100 */
#define ADC_AWD3LTR_LTR_9                   (0x000200UL << ADC_AWD3LTR_LTR_Pos)     /*!< 0x00000200 */
#define ADC_AWD3LTR_LTR_10                  (0x000400UL << ADC_AWD3LTR_LTR_Pos)     /*!< 0x00000400 */
#define ADC_AWD3LTR_LTR_11                  (0x000800UL << ADC_AWD3LTR_LTR_Pos)     /*!< 0x00000800 */
#define ADC_AWD3LTR_LTR_12                  (0x001000UL << ADC_AWD3LTR_LTR_Pos)     /*!< 0x00001000 */
#define ADC_AWD3LTR_LTR_13                  (0x002000UL << ADC_AWD3LTR_LTR_Pos)     /*!< 0x00002000 */
#define ADC_AWD3LTR_LTR_14                  (0x004000UL << ADC_AWD3LTR_LTR_Pos)     /*!< 0x00004000 */
#define ADC_AWD3LTR_LTR_15                  (0x008000UL << ADC_AWD3LTR_LTR_Pos)     /*!< 0x00008000 */
#define ADC_AWD3LTR_LTR_16                  (0x010000UL << ADC_AWD3LTR_LTR_Pos)     /*!< 0x00010000 */
#define ADC_AWD3LTR_LTR_17                  (0x020000UL << ADC_AWD3LTR_LTR_Pos)     /*!< 0x00020000 */
#define ADC_AWD3LTR_LTR_18                  (0x040000UL << ADC_AWD3LTR_LTR_Pos)     /*!< 0x00040000 */
#define ADC_AWD3LTR_LTR_19                  (0x080000UL << ADC_AWD3LTR_LTR_Pos)     /*!< 0x00080000 */
#define ADC_AWD3LTR_LTR_20                  (0x100000UL << ADC_AWD3LTR_LTR_Pos)     /*!< 0x00100000 */
#define ADC_AWD3LTR_LTR_21                  (0x200000UL << ADC_AWD3LTR_LTR_Pos)     /*!< 0x00200000 */
#define ADC_AWD3LTR_LTR_22                  (0x400000UL << ADC_AWD3LTR_LTR_Pos)     /*!< 0x00400000 */

/********************  Bit definition for ADC_AWD3TR_HT register  *******************/
#define ADC_AWD3HTR_HTR_Pos                 (0UL)
#define ADC_AWD3HTR_HTR_Msk                 (0x007FFFFFUL << ADC_AWD3HTR_HTR_Pos)   /*!< 0x007FFFFF */
#define ADC_AWD3HTR_HTR                     ADC_AWD3HTR_HTR_Msk                     /*!< ADC analog watchdog 3 threshold high */
#define ADC_AWD3HTR_HTR_0                   (0x000001UL << ADC_AWD3HTR_HTR_Pos)     /*!< 0x00000001 */
#define ADC_AWD3HTR_HTR_1                   (0x000002UL << ADC_AWD3HTR_HTR_Pos)     /*!< 0x00000002 */
#define ADC_AWD3HTR_HTR_2                   (0x000004UL << ADC_AWD3HTR_HTR_Pos)     /*!< 0x00000004 */
#define ADC_AWD3HTR_HTR_3                   (0x000008UL << ADC_AWD3HTR_HTR_Pos)     /*!< 0x00000008 */
#define ADC_AWD3HTR_HTR_4                   (0x000010UL << ADC_AWD3HTR_HTR_Pos)     /*!< 0x00000010 */
#define ADC_AWD3HTR_HTR_5                   (0x000020UL << ADC_AWD3HTR_HTR_Pos)     /*!< 0x00000020 */
#define ADC_AWD3HTR_HTR_6                   (0x000040UL << ADC_AWD3HTR_HTR_Pos)     /*!< 0x00000040 */
#define ADC_AWD3HTR_HTR_7                   (0x000080UL << ADC_AWD3HTR_HTR_Pos)     /*!< 0x00000080 */
#define ADC_AWD3HTR_HTR_8                   (0x000100UL << ADC_AWD3HTR_HTR_Pos)     /*!< 0x00000100 */
#define ADC_AWD3HTR_HTR_9                   (0x000200UL << ADC_AWD3HTR_HTR_Pos)     /*!< 0x00000200 */
#define ADC_AWD3HTR_HTR_10                  (0x000400UL << ADC_AWD3HTR_HTR_Pos)     /*!< 0x00000400 */
#define ADC_AWD3HTR_HTR_11                  (0x000800UL << ADC_AWD3HTR_HTR_Pos)     /*!< 0x00000800 */
#define ADC_AWD3HTR_HTR_12                  (0x001000UL << ADC_AWD3HTR_HTR_Pos)     /*!< 0x00001000 */
#define ADC_AWD3HTR_HTR_13                  (0x002000UL << ADC_AWD3HTR_HTR_Pos)     /*!< 0x00002000 */
#define ADC_AWD3HTR_HTR_14                  (0x004000UL << ADC_AWD3HTR_HTR_Pos)     /*!< 0x00004000 */
#define ADC_AWD3HTR_HTR_15                  (0x008000UL << ADC_AWD3HTR_HTR_Pos)     /*!< 0x00008000 */
#define ADC_AWD3HTR_HTR_16                  (0x010000UL << ADC_AWD3HTR_HTR_Pos)     /*!< 0x00010000 */
#define ADC_AWD3HTR_HTR_17                  (0x020000UL << ADC_AWD3HTR_HTR_Pos)     /*!< 0x00020000 */
#define ADC_AWD3HTR_HTR_18                  (0x040000UL << ADC_AWD3HTR_HTR_Pos)     /*!< 0x00040000 */
#define ADC_AWD3HTR_HTR_19                  (0x080000UL << ADC_AWD3HTR_HTR_Pos)     /*!< 0x00080000 */
#define ADC_AWD3HTR_HTR_20                  (0x100000UL << ADC_AWD3HTR_HTR_Pos)     /*!< 0x00100000 */
#define ADC_AWD3HTR_HTR_21                  (0x200000UL << ADC_AWD3HTR_HTR_Pos)     /*!< 0x00200000 */
#define ADC_AWD3HTR_HTR_22                  (0x400000UL << ADC_AWD3HTR_HTR_Pos)     /*!< 0x00400000 */

/********************  Bit definition for ADC_CALFACT register  ***************/

#define ADC_CALFACT_CALFACT_Pos             (0UL)
#define ADC_CALFACT_CALFACT_Msk             (0x7FUL << ADC_CALFACT_CALFACT_Pos)     /*!< 0x0000007F */
#define ADC_CALFACT_CALFACT                 ADC_CALFACT_CALFACT_Msk                 /*!< ADC calibration factor in single-ended mode */
#define ADC_CALFACT_CALFACT_0               (0x01UL << ADC_CALFACT_CALFACT_Pos)     /*!< 0x00000001 */
#define ADC_CALFACT_CALFACT_1               (0x02UL << ADC_CALFACT_CALFACT_Pos)     /*!< 0x00000002 */
#define ADC_CALFACT_CALFACT_2               (0x04UL << ADC_CALFACT_CALFACT_Pos)     /*!< 0x00000004 */
#define ADC_CALFACT_CALFACT_3               (0x08UL << ADC_CALFACT_CALFACT_Pos)     /*!< 0x00000008 */
#define ADC_CALFACT_CALFACT_4               (0x10UL << ADC_CALFACT_CALFACT_Pos)     /*!< 0x00000010 */
#define ADC_CALFACT_CALFACT_5               (0x20UL << ADC_CALFACT_CALFACT_Pos)     /*!< 0x00000020 */
#define ADC_CALFACT_CALFACT_6               (0x40UL << ADC_CALFACT_CALFACT_Pos)     /*!< 0x00000040 */
#define ADC_CALFACT_CALFACT_7               (0x80UL << ADC_CALFACT_CALFACT_Pos)     /*!< 0x00000080 */
#define ADC_CALFACT_CALFACT_8               (0x100UL<< ADC_CALFACT_CALFACT_Pos)     /*!< 0x00000100 */
#define ADC_CALFACT_CALFACT_9               (0x200UL<< ADC_CALFACT_CALFACT_Pos)     /*!< 0x00000200 */


/********************  Bit definition for ADC_OR option register  ***************/
#define ADC_OR_VDDCOREEN_Pos                (0UL)
#define ADC_OR_VDDCOREEN_Msk                (0x1UL << ADC_OR_VDDCOREEN_Pos)         /*!< 0x00000004 */
#define ADC_OR_VDDCOREEN                    ADC_OR_VDDCOREEN_Msk                    /*!< ADC internal path to VDDCORE */

/*************************  ADC Common registers  *****************************/
/********************  Bit definition for ADC_CSR register  *******************/
#define ADC_CSR_ADRDY_MST_Pos               (0UL)
#define ADC_CSR_ADRDY_MST_Msk               (0x1UL << ADC_CSR_ADRDY_MST_Pos)        /*!< 0x00000001 */
#define ADC_CSR_ADRDY_MST                   ADC_CSR_ADRDY_MST_Msk                   /*!< ADC multimode master ready flag */
#define ADC_CSR_EOSMP_MST_Pos               (1UL)
#define ADC_CSR_EOSMP_MST_Msk               (0x1UL << ADC_CSR_EOSMP_MST_Pos)        /*!< 0x00000002 */
#define ADC_CSR_EOSMP_MST                   ADC_CSR_EOSMP_MST_Msk                   /*!< ADC multimode master group regular end of sampling flag */
#define ADC_CSR_EOC_MST_Pos                 (2UL)
#define ADC_CSR_EOC_MST_Msk                 (0x1UL << ADC_CSR_EOC_MST_Pos)          /*!< 0x00000004 */
#define ADC_CSR_EOC_MST                     ADC_CSR_EOC_MST_Msk                     /*!< ADC multimode master group regular end of unitary conversion flag */
#define ADC_CSR_EOS_MST_Pos                 (3UL)
#define ADC_CSR_EOS_MST_Msk                 (0x1UL << ADC_CSR_EOS_MST_Pos)          /*!< 0x00000008 */
#define ADC_CSR_EOS_MST                     ADC_CSR_EOS_MST_Msk                     /*!< ADC multimode master group regular end of sequence conversions flag */
#define ADC_CSR_OVR_MST_Pos                 (4UL)
#define ADC_CSR_OVR_MST_Msk                 (0x1UL << ADC_CSR_OVR_MST_Pos)          /*!< 0x00000010 */
#define ADC_CSR_OVR_MST                     ADC_CSR_OVR_MST_Msk                     /*!< ADC multimode master group regular overrun flag */
#define ADC_CSR_JEOC_MST_Pos                (5UL)
#define ADC_CSR_JEOC_MST_Msk                (0x1UL << ADC_CSR_JEOC_MST_Pos)         /*!< 0x00000020 */
#define ADC_CSR_JEOC_MST                    ADC_CSR_JEOC_MST_Msk                    /*!< ADC multimode master group injected end of unitary conversion flag */
#define ADC_CSR_JEOS_MST_Pos                (6UL)
#define ADC_CSR_JEOS_MST_Msk                (0x1UL << ADC_CSR_JEOS_MST_Pos)         /*!< 0x00000040 */
#define ADC_CSR_JEOS_MST                    ADC_CSR_JEOS_MST_Msk                    /*!< ADC multimode master group injected end of sequence conversions flag */
#define ADC_CSR_AWD1_MST_Pos                (7UL)
#define ADC_CSR_AWD1_MST_Msk                (0x1UL << ADC_CSR_AWD1_MST_Pos)         /*!< 0x00000080 */
#define ADC_CSR_AWD1_MST                    ADC_CSR_AWD1_MST_Msk                    /*!< ADC multimode master analog watchdog 1 flag */
#define ADC_CSR_AWD2_MST_Pos                (8UL)
#define ADC_CSR_AWD2_MST_Msk                (0x1UL << ADC_CSR_AWD2_MST_Pos)         /*!< 0x00000100 */
#define ADC_CSR_AWD2_MST                    ADC_CSR_AWD2_MST_Msk                    /*!< ADC multimode master analog watchdog 2 flag */
#define ADC_CSR_AWD3_MST_Pos                (9UL)
#define ADC_CSR_AWD3_MST_Msk                (0x1UL << ADC_CSR_AWD3_MST_Pos)         /*!< 0x00000200 */
#define ADC_CSR_AWD3_MST                    ADC_CSR_AWD3_MST_Msk                    /*!< ADC multimode master analog watchdog 3 flag */
#define ADC_CSR_JQOVF_MST_Pos               (10UL)
#define ADC_CSR_JQOVF_MST_Msk               (0x1UL << ADC_CSR_JQOVF_MST_Pos)        /*!< 0x00000400 */
#define ADC_CSR_JQOVF_MST                   ADC_CSR_JQOVF_MST_Msk                   /*!< ADC multimode master group injected contexts queue overflow flag */
#define ADC_CSR_LDORDY_MST_Pos              (12UL)
#define ADC_CSR_LDORDY_MST_Msk              (0x1UL << ADC_CSR_LDORDY_MST_Pos)       /*!< 0x00001000 */
#define ADC_CSR_LDORDY_MST                  ADC_CSR_LDORDY_MST_Msk                  /*!< ADC multimode master internal voltage regulator output ready flag */

