zephyrproject-rtos/hal_stm32/stm32cube/stm32u3xx/soc/stm32u3a6xx.h
/*******************  Bit definition for EXTI_PRIVENR1 register  ******************/
#define EXTI_PRIVCFGR1_RPIF0_Pos            (0UL)
#define EXTI_PRIVCFGR1_RPIF0_Msk            (0x1UL << EXTI_PRIVCFGR1_RPIF0_Pos)     /*!< 0x00000001 */
#define EXTI_PRIVCFGR1_RPIF0                EXTI_PRIVCFGR1_RPIF0_Msk                /*!< Privilege enable on line 0 */
#define EXTI_PRIVCFGR1_RPIF1_Pos            (1UL)
#define EXTI_PRIVCFGR1_RPIF1_Msk            (0x1UL << EXTI_PRIVCFGR1_RPIF1_Pos)     /*!< 0x00000002 */
#define EXTI_PRIVCFGR1_RPIF1                EXTI_PRIVCFGR1_RPIF1_Msk                /*!< Privilege enable on line 1 */
#define EXTI_PRIVCFGR1_RPIF2_Pos            (2UL)
#define EXTI_PRIVCFGR1_RPIF2_Msk            (0x1UL << EXTI_PRIVCFGR1_RPIF2_Pos)     /*!< 0x00000004 */
#define EXTI_PRIVCFGR1_RPIF2                EXTI_PRIVCFGR1_RPIF2_Msk                /*!< Privilege enable on line 2 */
#define EXTI_PRIVCFGR1_RPIF3_Pos            (3UL)
#define EXTI_PRIVCFGR1_RPIF3_Msk            (0x1UL << EXTI_PRIVCFGR1_RPIF3_Pos)     /*!< 0x00000008 */
#define EXTI_PRIVCFGR1_RPIF3                EXTI_PRIVCFGR1_RPIF3_Msk                /*!< Privilege enable on line 3 */
#define EXTI_PRIVCFGR1_RPIF4_Pos            (4UL)
#define EXTI_PRIVCFGR1_RPIF4_Msk            (0x1UL << EXTI_PRIVCFGR1_RPIF4_Pos)     /*!< 0x00000010 */
#define EXTI_PRIVCFGR1_RPIF4                EXTI_PRIVCFGR1_RPIF4_Msk                /*!< Privilege enable on line 4 */
#define EXTI_PRIVCFGR1_RPIF5_Pos            (5UL)
#define EXTI_PRIVCFGR1_RPIF5_Msk            (0x1UL << EXTI_PRIVCFGR1_RPIF5_Pos)     /*!< 0x00000020 */
#define EXTI_PRIVCFGR1_RPIF5                EXTI_PRIVCFGR1_RPIF5_Msk                /*!< Privilege enable on line 5 */
#define EXTI_PRIVCFGR1_RPIF6_Pos            (6UL)
#define EXTI_PRIVCFGR1_RPIF6_Msk            (0x1UL << EXTI_PRIVCFGR1_RPIF6_Pos)     /*!< 0x00000040 */
#define EXTI_PRIVCFGR1_RPIF6                EXTI_PRIVCFGR1_RPIF6_Msk                /*!< Privilege enable on line 6 */
#define EXTI_PRIVCFGR1_RPIF7_Pos            (7UL)
#define EXTI_PRIVCFGR1_RPIF7_Msk            (0x1UL << EXTI_PRIVCFGR1_RPIF7_Pos)     /*!< 0x00000080 */
#define EXTI_PRIVCFGR1_RPIF7                EXTI_PRIVCFGR1_RPIF7_Msk                /*!< Privilege enable on line 7 */
#define EXTI_PRIVCFGR1_RPIF8_Pos            (8UL)
#define EXTI_PRIVCFGR1_RPIF8_Msk            (0x1UL << EXTI_PRIVCFGR1_RPIF8_Pos)     /*!< 0x00000100 */
#define EXTI_PRIVCFGR1_RPIF8                EXTI_PRIVCFGR1_RPIF8_Msk                /*!< Privilege enable on line 8 */
#define EXTI_PRIVCFGR1_RPIF9_Pos            (9UL)
#define EXTI_PRIVCFGR1_RPIF9_Msk            (0x1UL << EXTI_PRIVCFGR1_RPIF9_Pos)     /*!< 0x00000200 */
#define EXTI_PRIVCFGR1_RPIF9                EXTI_PRIVCFGR1_RPIF9_Msk                /*!< Privilege enable on line 9 */
#define EXTI_PRIVCFGR1_RPIF10_Pos           (10UL)
#define EXTI_PRIVCFGR1_RPIF10_Msk           (0x1UL << EXTI_PRIVCFGR1_RPIF10_Pos)    /*!< 0x00000400 */
#define EXTI_PRIVCFGR1_RPIF10               EXTI_PRIVCFGR1_RPIF10_Msk               /*!< Privilege enable on line 10 */
#define EXTI_PRIVCFGR1_RPIF11_Pos           (11UL)
#define EXTI_PRIVCFGR1_RPIF11_Msk           (0x1UL << EXTI_PRIVCFGR1_RPIF11_Pos)    /*!< 0x00000800 */
#define EXTI_PRIVCFGR1_RPIF11               EXTI_PRIVCFGR1_RPIF11_Msk               /*!< Privilege enable on line 11 */
#define EXTI_PRIVCFGR1_RPIF12_Pos           (12UL)
#define EXTI_PRIVCFGR1_RPIF12_Msk           (0x1UL << EXTI_PRIVCFGR1_RPIF12_Pos)    /*!< 0x00001000 */
#define EXTI_PRIVCFGR1_RPIF12               EXTI_PRIVCFGR1_RPIF12_Msk               /*!< Privilege enable on line 12 */
#define EXTI_PRIVCFGR1_RPIF13_Pos           (13UL)
#define EXTI_PRIVCFGR1_RPIF13_Msk           (0x1UL << EXTI_PRIVCFGR1_RPIF13_Pos)    /*!< 0x00002000 */
#define EXTI_PRIVCFGR1_RPIF13               EXTI_PRIVCFGR1_RPIF13_Msk               /*!< Privilege enable on line 13 */
#define EXTI_PRIVCFGR1_RPIF14_Pos           (14UL)
#define EXTI_PRIVCFGR1_RPIF14_Msk           (0x1UL << EXTI_PRIVCFGR1_RPIF14_Pos)    /*!< 0x00004000 */
#define EXTI_PRIVCFGR1_RPIF14               EXTI_PRIVCFGR1_RPIF14_Msk               /*!< Privilege enable on line 14 */
#define EXTI_PRIVCFGR1_RPIF15_Pos           (15UL)
#define EXTI_PRIVCFGR1_RPIF15_Msk           (0x1UL << EXTI_PRIVCFGR1_RPIF15_Pos)    /*!< 0x00008000 */
#define EXTI_PRIVCFGR1_RPIF15               EXTI_PRIVCFGR1_RPIF15_Msk               /*!< Privilege enable on line 15 */
#define EXTI_PRIVCFGR1_RPIF16_Pos           (16UL)
#define EXTI_PRIVCFGR1_RPIF16_Msk           (0x1UL << EXTI_PRIVCFGR1_RPIF16_Pos)    /*!< 0x00010000 */
#define EXTI_PRIVCFGR1_RPIF16               EXTI_PRIVCFGR1_RPIF16_Msk               /*!< Privilege enable on line 16 */
#define EXTI_PRIVCFGR1_RPIF17_Pos           (17UL)
#define EXTI_PRIVCFGR1_RPIF17_Msk           (0x1UL << EXTI_PRIVCFGR1_RPIF17_Pos)    /*!< 0x00020000 */
#define EXTI_PRIVCFGR1_RPIF17               EXTI_PRIVCFGR1_RPIF17_Msk               /*!< Privilege enable on line 17 */
#define EXTI_PRIVCFGR1_RPIF18_Pos           (18UL)
#define EXTI_PRIVCFGR1_RPIF18_Msk           (0x1UL << EXTI_PRIVCFGR1_RPIF18_Pos)    /*!< 0x00040000 */
#define EXTI_PRIVCFGR1_RPIF18               EXTI_PRIVCFGR1_RPIF18_Msk               /*!< Privilege enable on line 18 */
#define EXTI_PRIVCFGR1_RPIF19_Pos           (19UL)
#define EXTI_PRIVCFGR1_RPIF19_Msk           (0x1UL << EXTI_PRIVCFGR1_RPIF19_Pos)    /*!< 0x00080000 */
#define EXTI_PRIVCFGR1_RPIF19               EXTI_PRIVCFGR1_RPIF19_Msk               /*!< Privilege enable on line 19 */
#define EXTI_PRIVCFGR1_RPIF20_Pos           (20UL)
#define EXTI_PRIVCFGR1_RPIF20_Msk           (0x1UL << EXTI_PRIVCFGR1_RPIF20_Pos)    /*!< 0x00100000 */
#define EXTI_PRIVCFGR1_RPIF20               EXTI_PRIVCFGR1_RPIF20_Msk               /*!< Privilege enable on line 20 */
#define EXTI_PRIVCFGR1_RPIF21_Pos           (21UL)
#define EXTI_PRIVCFGR1_RPIF21_Msk           (0x1UL << EXTI_PRIVCFGR1_RPIF21_Pos)    /*!< 0x00200000 */
#define EXTI_PRIVCFGR1_RPIF21               EXTI_PRIVCFGR1_RPIF21_Msk               /*!< Privilege enable on line 21 */
#define EXTI_PRIVCFGR1_RPIF22_Pos           (22UL)
#define EXTI_PRIVCFGR1_RPIF22_Msk           (0x1UL << EXTI_PRIVCFGR1_RPIF22_Pos)    /*!< 0x00400000 */
#define EXTI_PRIVCFGR1_RPIF22               EXTI_PRIVCFGR1_RPIF22_Msk               /*!< Privilege enable on line 22 */

/*****************  Bit definition for EXTI_EXTICR1 register  **************/
#define EXTI_EXTICR1_EXTI0_Pos              (0UL)
#define EXTI_EXTICR1_EXTI0_Msk              (0xFUL << EXTI_EXTICR1_EXTI0_Pos)       /*!< 0x00000007 */
#define EXTI_EXTICR1_EXTI0                  EXTI_EXTICR1_EXTI0_Msk                  /*!< EXTI 0 configuration */
#define EXTI_EXTICR1_EXTI0_0                (0x1UL << EXTI_EXTICR1_EXTI0_Pos)       /*!< 0x00000001 */
#define EXTI_EXTICR1_EXTI0_1                (0x2UL << EXTI_EXTICR1_EXTI0_Pos)       /*!< 0x00000002 */
#define EXTI_EXTICR1_EXTI0_2                (0x4UL << EXTI_EXTICR1_EXTI0_Pos)       /*!< 0x00000004 */
#define EXTI_EXTICR1_EXTI0_3                (0x8UL << EXTI_EXTICR1_EXTI0_Pos)       /*!< 0x00000008 */
#define EXTI_EXTICR1_EXTI1_Pos              (8UL)
#define EXTI_EXTICR1_EXTI1_Msk              (0xFUL << EXTI_EXTICR1_EXTI1_Pos)       /*!< 0x00000700 */
#define EXTI_EXTICR1_EXTI1                  EXTI_EXTICR1_EXTI1_Msk                  /*!< EXTI 1 configuration */
#define EXTI_EXTICR1_EXTI1_0                (0x1UL << EXTI_EXTICR1_EXTI1_Pos)       /*!< 0x00000100 */
#define EXTI_EXTICR1_EXTI1_1                (0x2UL << EXTI_EXTICR1_EXTI1_Pos)       /*!< 0x00000200 */
#define EXTI_EXTICR1_EXTI1_2                (0x4UL << EXTI_EXTICR1_EXTI1_Pos)       /*!< 0x00000400 */
#define EXTI_EXTICR1_EXTI1_3                (0x8UL << EXTI_EXTICR1_EXTI1_Pos)       /*!< 0x00000800 */
#define EXTI_EXTICR1_EXTI2_Pos              (16UL)
#define EXTI_EXTICR1_EXTI2_Msk              (0xFUL << EXTI_EXTICR1_EXTI2_Pos)       /*!< 0x00070000 */
#define EXTI_EXTICR1_EXTI2                  EXTI_EXTICR1_EXTI2_Msk                  /*!< EXTI 2 configuration */
#define EXTI_EXTICR1_EXTI2_0                (0x1UL << EXTI_EXTICR1_EXTI2_Pos)       /*!< 0x00010000 */
#define EXTI_EXTICR1_EXTI2_1                (0x2UL << EXTI_EXTICR1_EXTI2_Pos)       /*!< 0x00020000 */
#define EXTI_EXTICR1_EXTI2_2                (0x4UL << EXTI_EXTICR1_EXTI2_Pos)       /*!< 0x00040000 */
#define EXTI_EXTICR1_EXTI2_3                (0x8UL << EXTI_EXTICR1_EXTI2_Pos)       /*!< 0x00080000 */
#define EXTI_EXTICR1_EXTI3_Pos              (24UL)
#define EXTI_EXTICR1_EXTI3_Msk              (0xFUL << EXTI_EXTICR1_EXTI3_Pos)       /*!< 0x07000000 */
#define EXTI_EXTICR1_EXTI3                  EXTI_EXTICR1_EXTI3_Msk                  /*!< EXTI 3 configuration */
#define EXTI_EXTICR1_EXTI3_0                (0x1UL << EXTI_EXTICR1_EXTI3_Pos)       /*!< 0x01000000 */
#define EXTI_EXTICR1_EXTI3_1                (0x2UL << EXTI_EXTICR1_EXTI3_Pos)       /*!< 0x02000000 */
#define EXTI_EXTICR1_EXTI3_2                (0x4UL << EXTI_EXTICR1_EXTI3_Pos)       /*!< 0x04000000 */
#define EXTI_EXTICR1_EXTI3_3                (0x8UL << EXTI_EXTICR1_EXTI3_Pos)       /*!< 0x08000000 */

/*****************  Bit definition for EXTI_EXTICR2 register  **************/
#define EXTI_EXTICR2_EXTI4_Pos              (0UL)
#define EXTI_EXTICR2_EXTI4_Msk              (0xFUL << EXTI_EXTICR2_EXTI4_Pos)       /*!< 0x00000007 */
#define EXTI_EXTICR2_EXTI4                  EXTI_EXTICR2_EXTI4_Msk                  /*!< EXTI 4 configuration */
#define EXTI_EXTICR2_EXTI4_0                (0x1UL << EXTI_EXTICR2_EXTI4_Pos)       /*!< 0x00000001 */
#define EXTI_EXTICR2_EXTI4_1                (0x2UL << EXTI_EXTICR2_EXTI4_Pos)       /*!< 0x00000002 */
#define EXTI_EXTICR2_EXTI4_2                (0x4UL << EXTI_EXTICR2_EXTI4_Pos)       /*!< 0x00000004 */
#define EXTI_EXTICR2_EXTI4_3                (0x8UL << EXTI_EXTICR2_EXTI4_Pos)       /*!< 0x00000008 */
#define EXTI_EXTICR2_EXTI5_Pos              (8UL)
#define EXTI_EXTICR2_EXTI5_Msk              (0xFUL << EXTI_EXTICR2_EXTI5_Pos)       /*!< 0x00000700 */
#define EXTI_EXTICR2_EXTI5                  EXTI_EXTICR2_EXTI5_Msk                  /*!< EXTI 5 configuration */
#define EXTI_EXTICR2_EXTI5_0                (0x1UL << EXTI_EXTICR2_EXTI5_Pos)       /*!< 0x00000100 */
#define EXTI_EXTICR2_EXTI5_1                (0x2UL << EXTI_EXTICR2_EXTI5_Pos)       /*!< 0x00000200 */
#define EXTI_EXTICR2_EXTI5_2                (0x4UL << EXTI_EXTICR2_EXTI5_Pos)       /*!< 0x00000400 */
#define EXTI_EXTICR2_EXTI5_3                (0x8UL << EXTI_EXTICR2_EXTI5_Pos)       /*!< 0x00000800 */
#define EXTI_EXTICR2_EXTI6_Pos              (16UL)
#define EXTI_EXTICR2_EXTI6_Msk              (0xFUL << EXTI_EXTICR2_EXTI6_Pos)       /*!< 0x00070000 */
#define EXTI_EXTICR2_EXTI6                  EXTI_EXTICR2_EXTI6_Msk                  /*!< EXTI 6 configuration */
#define EXTI_EXTICR2_EXTI6_0                (0x1UL << EXTI_EXTICR2_EXTI6_Pos)       /*!< 0x00010000 */
#define EXTI_EXTICR2_EXTI6_1                (0x2UL << EXTI_EXTICR2_EXTI6_Pos)       /*!< 0x00020000 */
#define EXTI_EXTICR2_EXTI6_2                (0x4UL << EXTI_EXTICR2_EXTI6_Pos)       /*!< 0x00040000 */
#define EXTI_EXTICR2_EXTI6_3                (0x8UL << EXTI_EXTICR2_EXTI6_Pos)       /*!< 0x00080000 */
#define EXTI_EXTICR2_EXTI7_Pos              (24UL)
#define EXTI_EXTICR2_EXTI7_Msk              (0xFUL << EXTI_EXTICR2_EXTI7_Pos)       /*!< 0x07000000 */
#define EXTI_EXTICR2_EXTI7                  EXTI_EXTICR2_EXTI7_Msk                  /*!< EXTI 7 configuration */
#define EXTI_EXTICR2_EXTI7_0                (0x1UL << EXTI_EXTICR2_EXTI7_Pos)       /*!< 0x01000000 */
#define EXTI_EXTICR2_EXTI7_1                (0x2UL << EXTI_EXTICR2_EXTI7_Pos)       /*!< 0x02000000 */
#define EXTI_EXTICR2_EXTI7_2                (0x4UL << EXTI_EXTICR2_EXTI7_Pos)       /*!< 0x04000000 */
#define EXTI_EXTICR2_EXTI7_3                (0x8UL << EXTI_EXTICR2_EXTI7_Pos)       /*!< 0x08000000 */

