zephyrproject-rtos/hal_stm32/stm32cube/stm32u3xx/soc/stm32u3a6xx.h
/**********************  Bits definition for FLASH_SECHDPCR register  ***************/
#define FLASH_SECHDPCR_HDP1_ACCDIS_Pos            (0UL)
#define FLASH_SECHDPCR_HDP1_ACCDIS_Msk            (0xFFUL << FLASH_SECHDPCR_HDP1_ACCDIS_Pos)    /*!< 0x000000FF */
#define FLASH_SECHDPCR_HDP1_ACCDIS                FLASH_SECHDPCR_HDP1_ACCDIS_Msk                /*!< HDP1 area access disable */
#define FLASH_SECHDPCR_HDP2_ACCDIS_Pos            (8UL)
#define FLASH_SECHDPCR_HDP2_ACCDIS_Msk            (0xFFUL << FLASH_SECHDPCR_HDP2_ACCDIS_Pos)    /*!< 0x0000FF00 */
#define FLASH_SECHDPCR_HDP2_ACCDIS                FLASH_SECHDPCR_HDP2_ACCDIS_Msk                /*!< HDP2 area access disable */
#define FLASH_SECHDPCR_HDP1EXT_ACCDIS_Pos         (16UL)
#define FLASH_SECHDPCR_HDP1EXT_ACCDIS_Msk         (0xFFUL << FLASH_SECHDPCR_HDP1EXT_ACCDIS_Pos) /*!< 0x00FF0000 */
#define FLASH_SECHDPCR_HDP1EXT_ACCDIS             FLASH_SECHDPCR_HDP1EXT_ACCDIS_Msk             /*!< HDP1 extension area access disable */
#define FLASH_SECHDPCR_HDP2EXT_ACCDIS_Pos         (24UL)
#define FLASH_SECHDPCR_HDP2EXT_ACCDIS_Msk         (0xFFUL << FLASH_SECHDPCR_HDP2EXT_ACCDIS_Pos) /*!< 0xFF000000 */
#define FLASH_SECHDPCR_HDP2EXT_ACCDIS             FLASH_SECHDPCR_HDP2EXT_ACCDIS_Msk             /*!< HDP2 extension area access disable */

/**********************  Bits definition for FLASH_PRIVCFGR register  ***************/
#define FLASH_PRIVCFGR_SPRIV_Pos                  (0UL)
#define FLASH_PRIVCFGR_SPRIV_Msk                  (0x1UL << FLASH_PRIVCFGR_SPRIV_Pos)           /*!< 0x00000001 */
#define FLASH_PRIVCFGR_SPRIV                      FLASH_PRIVCFGR_SPRIV_Msk                      /*!< Privilege protection for secure registers */
#define FLASH_PRIVCFGR_PRIV_Pos                   (1UL)
#define FLASH_PRIVCFGR_PRIV_Msk                   (0x1UL << FLASH_PRIVCFGR_PRIV_Pos)            /*!< 0x00000002 */
#define FLASH_PRIVCFGR_PRIV                       FLASH_PRIVCFGR_PRIV_Msk                       /*!< Privilege protection for non-secure registers */

/*********************  Bits definition for FLASH_SECHDPEXTR register  **************/
#define FLASH_SECHDPEXTR_HDP1_EXT_Pos             (0UL)
#define FLASH_SECHDPEXTR_HDP1_EXT_Msk             (0x1FFUL << FLASH_SECHDPEXTR_HDP1_EXT_Pos)    /*!< 0x000001FF */
#define FLASH_SECHDPEXTR_HDP1_EXT                 FLASH_SECHDPEXTR_HDP1_EXT_Msk                 /*!< HDP area extension in 4Kbytes pages in bank 1 */
#define FLASH_SECHDPEXTR_HDP2_EXT_Pos             (16UL)
#define FLASH_SECHDPEXTR_HDP2_EXT_Msk             (0x1FFUL << FLASH_SECHDPEXTR_HDP2_EXT_Pos)    /*!< 0x01FF0000 */
#define FLASH_SECHDPEXTR_HDP2_EXT                 FLASH_SECHDPEXTR_HDP2_EXT_Msk                 /*!< HDP area extension in 4Kbytes pages in bank 2 */

/*******************  Bit definition for FLASH_PRIVBB1R1 register  ******************/
#define FLASH_PRIVBB1R1_PRIV0_Pos                   (0UL)
#define FLASH_PRIVBB1R1_PRIV0_Msk                   (0x1UL << FLASH_PRIVBB1R1_PRIV0_Pos)            /*!< 0x00000001 */
#define FLASH_PRIVBB1R1_PRIV0                       FLASH_PRIVBB1R1_PRIV0_Msk                       /*!< Page 0 in bank 1 block-based privilege */
#define FLASH_PRIVBB1R1_PRIV1_Pos                   (1UL)
#define FLASH_PRIVBB1R1_PRIV1_Msk                   (0x1UL << FLASH_PRIVBB1R1_PRIV1_Pos)            /*!< 0x00000002 */
#define FLASH_PRIVBB1R1_PRIV1                       FLASH_PRIVBB1R1_PRIV1_Msk                       /*!< Page 1 in bank 1 block-based privilege */
#define FLASH_PRIVBB1R1_PRIV2_Pos                   (2UL)
#define FLASH_PRIVBB1R1_PRIV2_Msk                   (0x1UL << FLASH_PRIVBB1R1_PRIV2_Pos)            /*!< 0x00000004 */
#define FLASH_PRIVBB1R1_PRIV2                       FLASH_PRIVBB1R1_PRIV2_Msk                       /*!< Page 2 in bank 1 block-based privilege */
#define FLASH_PRIVBB1R1_PRIV3_Pos                   (3UL)
#define FLASH_PRIVBB1R1_PRIV3_Msk                   (0x1UL << FLASH_PRIVBB1R1_PRIV3_Pos)            /*!< 0x00000008 */
#define FLASH_PRIVBB1R1_PRIV3                       FLASH_PRIVBB1R1_PRIV3_Msk                       /*!< Page 3 in bank 1 block-based privilege */
#define FLASH_PRIVBB1R1_PRIV4_Pos                   (4UL)
#define FLASH_PRIVBB1R1_PRIV4_Msk                   (0x1UL << FLASH_PRIVBB1R1_PRIV4_Pos)            /*!< 0x00000010 */
#define FLASH_PRIVBB1R1_PRIV4                       FLASH_PRIVBB1R1_PRIV4_Msk                       /*!< Page 4 in bank 1 block-based privilege */
#define FLASH_PRIVBB1R1_PRIV5_Pos                   (5UL)
#define FLASH_PRIVBB1R1_PRIV5_Msk                   (0x1UL << FLASH_PRIVBB1R1_PRIV5_Pos)            /*!< 0x00000020 */
#define FLASH_PRIVBB1R1_PRIV5                       FLASH_PRIVBB1R1_PRIV5_Msk                       /*!< Page 5 in bank 1 block-based privilege */
#define FLASH_PRIVBB1R1_PRIV6_Pos                   (6UL)
#define FLASH_PRIVBB1R1_PRIV6_Msk                   (0x1UL << FLASH_PRIVBB1R1_PRIV6_Pos)            /*!< 0x00000040 */
#define FLASH_PRIVBB1R1_PRIV6                       FLASH_PRIVBB1R1_PRIV6_Msk                       /*!< Page 6 in bank 1 block-based privilege */
#define FLASH_PRIVBB1R1_PRIV7_Pos                   (7UL)
#define FLASH_PRIVBB1R1_PRIV7_Msk                   (0x1UL << FLASH_PRIVBB1R1_PRIV7_Pos)            /*!< 0x00000080 */
#define FLASH_PRIVBB1R1_PRIV7                       FLASH_PRIVBB1R1_PRIV7_Msk                       /*!< Page 7 in bank 1 block-based privilege */
#define FLASH_PRIVBB1R1_PRIV8_Pos                   (8UL)
#define FLASH_PRIVBB1R1_PRIV8_Msk                   (0x1UL << FLASH_PRIVBB1R1_PRIV8_Pos)            /*!< 0x00000100 */
#define FLASH_PRIVBB1R1_PRIV8                       FLASH_PRIVBB1R1_PRIV8_Msk                       /*!< Page 8 in bank 1 block-based privilege */
#define FLASH_PRIVBB1R1_PRIV9_Pos                   (9UL)
#define FLASH_PRIVBB1R1_PRIV9_Msk                   (0x1UL << FLASH_PRIVBB1R1_PRIV9_Pos)            /*!< 0x00000200 */
#define FLASH_PRIVBB1R1_PRIV9                       FLASH_PRIVBB1R1_PRIV9_Msk                       /*!< Page 9 in bank 1 block-based privilege */
#define FLASH_PRIVBB1R1_PRIV10_Pos                  (10UL)
#define FLASH_PRIVBB1R1_PRIV10_Msk                  (0x1UL << FLASH_PRIVBB1R1_PRIV10_Pos)           /*!< 0x00000400 */
#define FLASH_PRIVBB1R1_PRIV10                      FLASH_PRIVBB1R1_PRIV10_Msk                      /*!< Page 10 in bank 1 block-based privilege */
#define FLASH_PRIVBB1R1_PRIV11_Pos                  (11UL)
#define FLASH_PRIVBB1R1_PRIV11_Msk                  (0x1UL << FLASH_PRIVBB1R1_PRIV11_Pos)           /*!< 0x00000800 */
#define FLASH_PRIVBB1R1_PRIV11                      FLASH_PRIVBB1R1_PRIV11_Msk                      /*!< Page 11 in bank 1 block-based privilege */
#define FLASH_PRIVBB1R1_PRIV12_Pos                  (12UL)
#define FLASH_PRIVBB1R1_PRIV12_Msk                  (0x1UL << FLASH_PRIVBB1R1_PRIV12_Pos)           /*!< 0x00001000 */
#define FLASH_PRIVBB1R1_PRIV12                      FLASH_PRIVBB1R1_PRIV12_Msk                      /*!< Page 12 in bank 1 block-based privilege */
#define FLASH_PRIVBB1R1_PRIV13_Pos                  (13UL)
#define FLASH_PRIVBB1R1_PRIV13_Msk                  (0x1UL << FLASH_PRIVBB1R1_PRIV13_Pos)           /*!< 0x00002000 */
#define FLASH_PRIVBB1R1_PRIV13                      FLASH_PRIVBB1R1_PRIV13_Msk                      /*!< Page 13 in bank 1 block-based privilege */
#define FLASH_PRIVBB1R1_PRIV14_Pos                  (14UL)
#define FLASH_PRIVBB1R1_PRIV14_Msk                  (0x1UL << FLASH_PRIVBB1R1_PRIV14_Pos)           /*!< 0x00004000 */
#define FLASH_PRIVBB1R1_PRIV14                      FLASH_PRIVBB1R1_PRIV14_Msk                      /*!< Page 14 in bank 1 block-based privilege */
#define FLASH_PRIVBB1R1_PRIV15_Pos                  (15UL)
#define FLASH_PRIVBB1R1_PRIV15_Msk                  (0x1UL << FLASH_PRIVBB1R1_PRIV15_Pos)           /*!< 0x00008000 */
#define FLASH_PRIVBB1R1_PRIV15                      FLASH_PRIVBB1R1_PRIV15_Msk                      /*!< Page 15 in bank 1 block-based privilege */
#define FLASH_PRIVBB1R1_PRIV16_Pos                  (16UL)
#define FLASH_PRIVBB1R1_PRIV16_Msk                  (0x1UL << FLASH_PRIVBB1R1_PRIV16_Pos)           /*!< 0x00010000 */
#define FLASH_PRIVBB1R1_PRIV16                      FLASH_PRIVBB1R1_PRIV16_Msk                      /*!< Page 16 in bank 1 block-based privilege */
#define FLASH_PRIVBB1R1_PRIV17_Pos                  (17UL)
#define FLASH_PRIVBB1R1_PRIV17_Msk                  (0x1UL << FLASH_PRIVBB1R1_PRIV17_Pos)           /*!< 0x00020000 */
#define FLASH_PRIVBB1R1_PRIV17                      FLASH_PRIVBB1R1_PRIV17_Msk                      /*!< Page 17 in bank 1 block-based privilege */
#define FLASH_PRIVBB1R1_PRIV18_Pos                  (18UL)
#define FLASH_PRIVBB1R1_PRIV18_Msk                  (0x1UL << FLASH_PRIVBB1R1_PRIV18_Pos)           /*!< 0x00040000 */
#define FLASH_PRIVBB1R1_PRIV18                      FLASH_PRIVBB1R1_PRIV18_Msk                      /*!< Page 18 in bank 1 block-based privilege */
#define FLASH_PRIVBB1R1_PRIV19_Pos                  (19UL)
#define FLASH_PRIVBB1R1_PRIV19_Msk                  (0x1UL << FLASH_PRIVBB1R1_PRIV19_Pos)           /*!< 0x00080000 */
#define FLASH_PRIVBB1R1_PRIV19                      FLASH_PRIVBB1R1_PRIV19_Msk                      /*!< Page 19 in bank 1 block-based privilege */
#define FLASH_PRIVBB1R1_PRIV20_Pos                  (20UL)
#define FLASH_PRIVBB1R1_PRIV20_Msk                  (0x1UL << FLASH_PRIVBB1R1_PRIV20_Pos)           /*!< 0x00100000 */
#define FLASH_PRIVBB1R1_PRIV20                      FLASH_PRIVBB1R1_PRIV20_Msk                      /*!< Page 20 in bank 1 block-based privilege */
#define FLASH_PRIVBB1R1_PRIV21_Pos                  (21UL)
#define FLASH_PRIVBB1R1_PRIV21_Msk                  (0x1UL << FLASH_PRIVBB1R1_PRIV21_Pos)           /*!< 0x00200000 */
#define FLASH_PRIVBB1R1_PRIV21                      FLASH_PRIVBB1R1_PRIV21_Msk                      /*!< Page 21 in bank 1 block-based privilege */
#define FLASH_PRIVBB1R1_PRIV22_Pos                  (22UL)
#define FLASH_PRIVBB1R1_PRIV22_Msk                  (0x1UL << FLASH_PRIVBB1R1_PRIV22_Pos)           /*!< 0x00400000 */
#define FLASH_PRIVBB1R1_PRIV22                      FLASH_PRIVBB1R1_PRIV22_Msk                      /*!< Page 22 in bank 1 block-based privilege */
#define FLASH_PRIVBB1R1_PRIV23_Pos                  (23UL)
#define FLASH_PRIVBB1R1_PRIV23_Msk                  (0x1UL << FLASH_PRIVBB1R1_PRIV23_Pos)           /*!< 0x00800000 */
#define FLASH_PRIVBB1R1_PRIV23                      FLASH_PRIVBB1R1_PRIV23_Msk                      /*!< Page 23 in bank 1 block-based privilege */
#define FLASH_PRIVBB1R1_PRIV24_Pos                  (24UL)
#define FLASH_PRIVBB1R1_PRIV24_Msk                  (0x1UL << FLASH_PRIVBB1R1_PRIV24_Pos)           /*!< 0x01000000 */
#define FLASH_PRIVBB1R1_PRIV24                      FLASH_PRIVBB1R1_PRIV24_Msk                      /*!< Page 24 in bank 1 block-based privilege */
#define FLASH_PRIVBB1R1_PRIV25_Pos                  (25UL)
#define FLASH_PRIVBB1R1_PRIV25_Msk                  (0x1UL << FLASH_PRIVBB1R1_PRIV25_Pos)           /*!< 0x02000000 */
#define FLASH_PRIVBB1R1_PRIV25                      FLASH_PRIVBB1R1_PRIV25_Msk                      /*!< Page 25 in bank 1 block-based privilege */
#define FLASH_PRIVBB1R1_PRIV26_Pos                  (26UL)
#define FLASH_PRIVBB1R1_PRIV26_Msk                  (0x1UL << FLASH_PRIVBB1R1_PRIV26_Pos)           /*!< 0x04000000 */
#define FLASH_PRIVBB1R1_PRIV26                      FLASH_PRIVBB1R1_PRIV26_Msk                      /*!< Page 26 in bank 1 block-based privilege */
#define FLASH_PRIVBB1R1_PRIV27_Pos                  (27UL)
#define FLASH_PRIVBB1R1_PRIV27_Msk                  (0x1UL << FLASH_PRIVBB1R1_PRIV27_Pos)           /*!< 0x08000000 */
#define FLASH_PRIVBB1R1_PRIV27                      FLASH_PRIVBB1R1_PRIV27_Msk                      /*!< Page 27 in bank 1 block-based privilege */
#define FLASH_PRIVBB1R1_PRIV28_Pos                  (28UL)
#define FLASH_PRIVBB1R1_PRIV28_Msk                  (0x1UL << FLASH_PRIVBB1R1_PRIV28_Pos)           /*!< 0x10000000 */
#define FLASH_PRIVBB1R1_PRIV28                      FLASH_PRIVBB1R1_PRIV28_Msk                      /*!< Page 28 in bank 1 block-based privilege */
#define FLASH_PRIVBB1R1_PRIV29_Pos                  (29UL)
#define FLASH_PRIVBB1R1_PRIV29_Msk                  (0x1UL << FLASH_PRIVBB1R1_PRIV29_Pos)           /*!< 0x20000000 */
#define FLASH_PRIVBB1R1_PRIV29                      FLASH_PRIVBB1R1_PRIV29_Msk                      /*!< Page 29 in bank 1 block-based privilege */
#define FLASH_PRIVBB1R1_PRIV30_Pos                  (30UL)
#define FLASH_PRIVBB1R1_PRIV30_Msk                  (0x1UL << FLASH_PRIVBB1R1_PRIV30_Pos)           /*!< 0x40000000 */
#define FLASH_PRIVBB1R1_PRIV30                      FLASH_PRIVBB1R1_PRIV30_Msk                      /*!< Page 30 in bank 1 block-based privilege */
#define FLASH_PRIVBB1R1_PRIV31_Pos                  (31UL)
#define FLASH_PRIVBB1R1_PRIV31_Msk                  (0x1UL << FLASH_PRIVBB1R1_PRIV31_Pos)           /*!< 0x80000000 */
#define FLASH_PRIVBB1R1_PRIV31                      FLASH_PRIVBB1R1_PRIV31_Msk                      /*!< Page 31 in bank 1 block-based privilege */

