zephyrproject-rtos/hal_stm32/stm32cube/stm32u3xx/soc/stm32u3a6xx.h
#define HSP_ESYNC2SRCR_EV18SSRC_Pos (4UL)
#define HSP_ESYNC2SRCR_EV18SSRC_Msk (0x3UL << HSP_ESYNC2SRCR_EV18SSRC_Pos) /*!< 0x00000030 */
#define HSP_ESYNC2SRCR_EV18SSRC     HSP_ESYNC2SRCR_EV18SSRC_Msk            /*!< EV18SSRC[1:0] bits (Event 18 synchronization source) */
#define HSP_ESYNC2SRCR_EV18SSRC_0   (0x1UL << HSP_ESYNC2SRCR_EV18SSRC_Pos) /*!< 0x00000010 */
#define HSP_ESYNC2SRCR_EV18SSRC_1   (0x2UL << HSP_ESYNC2SRCR_EV18SSRC_Pos) /*!< 0x00000020 */

#define HSP_ESYNC2SRCR_EV19SSRC_Pos (8UL)
#define HSP_ESYNC2SRCR_EV19SSRC_Msk (0x3UL << HSP_ESYNC2SRCR_EV19SSRC_Pos) /*!< 0x00000300 */
#define HSP_ESYNC2SRCR_EV19SSRC     HSP_ESYNC2SRCR_EV19SSRC_Msk            /*!< EV19SSRC[1:0] bits (Event 19 synchronization source) */
#define HSP_ESYNC2SRCR_EV19SSRC_0   (0x1UL << HSP_ESYNC2SRCR_EV19SSRC_Pos) /*!< 0x00000100 */
#define HSP_ESYNC2SRCR_EV19SSRC_1   (0x2UL << HSP_ESYNC2SRCR_EV19SSRC_Pos) /*!< 0x00000200 */

#define HSP_ESYNC2SRCR_EV20SSRC_Pos (12UL)
#define HSP_ESYNC2SRCR_EV20SSRC_Msk (0x3UL << HSP_ESYNC2SRCR_EV20SSRC_Pos) /*!< 0x00003000 */
#define HSP_ESYNC2SRCR_EV20SSRC     HSP_ESYNC2SRCR_EV20SSRC_Msk            /*!< EV20SSRC[1:0] bits (Event 20 synchronization source) */
#define HSP_ESYNC2SRCR_EV20SSRC_0   (0x1UL << HSP_ESYNC2SRCR_EV20SSRC_Pos) /*!< 0x00001000 */
#define HSP_ESYNC2SRCR_EV20SSRC_1   (0x2UL << HSP_ESYNC2SRCR_EV20SSRC_Pos) /*!< 0x00002000 */

#define HSP_ESYNC2SRCR_EV21SSRC_Pos (16UL)
#define HSP_ESYNC2SRCR_EV21SSRC_Msk (0x3UL << HSP_ESYNC2SRCR_EV21SSRC_Pos) /*!< 0x00030000 */
#define HSP_ESYNC2SRCR_EV21SSRC     HSP_ESYNC2SRCR_EV21SSRC_Msk            /*!< EV21SSRC[1:0] bits (Event 21 synchronization source) */
#define HSP_ESYNC2SRCR_EV21SSRC_0   (0x1UL << HSP_ESYNC2SRCR_EV21SSRC_Pos) /*!< 0x00010000 */
#define HSP_ESYNC2SRCR_EV21SSRC_1   (0x2UL << HSP_ESYNC2SRCR_EV21SSRC_Pos) /*!< 0x00020000 */

#define HSP_ESYNC2SRCR_EV22SSRC_Pos (20UL)
#define HSP_ESYNC2SRCR_EV22SSRC_Msk (0x3UL << HSP_ESYNC2SRCR_EV22SSRC_Pos) /*!< 0x00300000 */
#define HSP_ESYNC2SRCR_EV22SSRC     HSP_ESYNC2SRCR_EV22SSRC_Msk            /*!< EV22SSRC[1:0] bits (Event 22 synchronization source) */
#define HSP_ESYNC2SRCR_EV22SSRC_0   (0x1UL << HSP_ESYNC2SRCR_EV22SSRC_Pos) /*!< 0x00100000 */
#define HSP_ESYNC2SRCR_EV22SSRC_1   (0x2UL << HSP_ESYNC2SRCR_EV22SSRC_Pos) /*!< 0x00200000 */

#define HSP_ESYNC2SRCR_CDEGSSRC_Pos (30UL)
#define HSP_ESYNC2SRCR_CDEGSSRC_Msk (0x3UL << HSP_ESYNC2SRCR_CDEGSSRC_Pos) /*!< 0xC0000000 */
#define HSP_ESYNC2SRCR_CDEGSSRC     HSP_ESYNC2SRCR_CDEGSSRC_Msk            /*!< CDEGSSRC[1:0] bits (CPU dedicated event synchronization source) */
#define HSP_ESYNC2SRCR_CDEGSSRC_0   (0x1UL << HSP_ESYNC2SRCR_CDEGSSRC_Pos) /*!< 0x40000000 */
#define HSP_ESYNC2SRCR_CDEGSSRC_1   (0x2UL << HSP_ESYNC2SRCR_CDEGSSRC_Pos) /*!< 0x80000000 */

/********************  Bit definition for HSP_PEVTLR register  ********************/
#define HSP_PEVTLR_EVTL_Pos (0UL)
#define HSP_PEVTLR_EVTL_Msk (0xFFFFFFFUL << HSP_PEVTLR_EVTL_Pos) /*!< 0x0FFFFFFF */
#define HSP_PEVTLR_EVTL     HSP_PEVTLR_EVTL_Msk                  /*!< EVTL[27:0] bits (Event level) */
#define HSP_PEVTLR_EVTL_0   (0x0001UL << HSP_PEVTLR_EVTL_Pos)    /*!< 0x00000001 */
#define HSP_PEVTLR_EVTL_1   (0x0002UL << HSP_PEVTLR_EVTL_Pos)    /*!< 0x00000002 */
#define HSP_PEVTLR_EVTL_2   (0x0004UL << HSP_PEVTLR_EVTL_Pos)    /*!< 0x00000004 */
#define HSP_PEVTLR_EVTL_3   (0x0008UL << HSP_PEVTLR_EVTL_Pos)    /*!< 0x00000008 */
#define HSP_PEVTLR_EVTL_4   (0x0010UL << HSP_PEVTLR_EVTL_Pos)    /*!< 0x00000010 */
#define HSP_PEVTLR_EVTL_5   (0x0020UL << HSP_PEVTLR_EVTL_Pos)    /*!< 0x00000020 */
#define HSP_PEVTLR_EVTL_6   (0x0040UL << HSP_PEVTLR_EVTL_Pos)    /*!< 0x00000040 */
#define HSP_PEVTLR_EVTL_7   (0x0080UL << HSP_PEVTLR_EVTL_Pos)    /*!< 0x00000080 */
#define HSP_PEVTLR_EVTL_8   (0x0100UL << HSP_PEVTLR_EVTL_Pos)    /*!< 0x00000100 */
#define HSP_PEVTLR_EVTL_9   (0x0200UL << HSP_PEVTLR_EVTL_Pos)    /*!< 0x00000200 */
#define HSP_PEVTLR_EVTL_10  (0x0400UL << HSP_PEVTLR_EVTL_Pos)    /*!< 0x00000400 */
#define HSP_PEVTLR_EVTL_11  (0x0800UL << HSP_PEVTLR_EVTL_Pos)    /*!< 0x00000800 */
#define HSP_PEVTLR_EVTL_12  (0x1000UL << HSP_PEVTLR_EVTL_Pos)    /*!< 0x00001000 */
#define HSP_PEVTLR_EVTL_13  (0x2000UL << HSP_PEVTLR_EVTL_Pos)    /*!< 0x00002000 */
#define HSP_PEVTLR_EVTL_14  (0x4000UL << HSP_PEVTLR_EVTL_Pos)    /*!< 0x00004000 */
#define HSP_PEVTLR_EVTL_15  (0x8000UL << HSP_PEVTLR_EVTL_Pos)    /*!< 0x00008000 */
#define HSP_PEVTLR_EVTL_16  (0x10000UL << HSP_PEVTLR_EVTL_Pos)   /*!< 0x00010000 */
#define HSP_PEVTLR_EVTL_17  (0x20000UL << HSP_PEVTLR_EVTL_Pos)   /*!< 0x00020000 */
#define HSP_PEVTLR_EVTL_18  (0x40000UL << HSP_PEVTLR_EVTL_Pos)   /*!< 0x00040000 */
#define HSP_PEVTLR_EVTL_19  (0x80000UL << HSP_PEVTLR_EVTL_Pos)   /*!< 0x00080000 */
#define HSP_PEVTLR_EVTL_20  (0x100000UL << HSP_PEVTLR_EVTL_Pos)  /*!< 0x00100000 */
#define HSP_PEVTLR_EVTL_21  (0x200000UL << HSP_PEVTLR_EVTL_Pos)  /*!< 0x00200000 */
#define HSP_PEVTLR_EVTL_22  (0x400000UL << HSP_PEVTLR_EVTL_Pos)  /*!< 0x00400000 */
#define HSP_PEVTLR_EVTL_23  (0x800000UL << HSP_PEVTLR_EVTL_Pos)  /*!< 0x00800000 */
#define HSP_PEVTLR_EVTL_24  (0x1000000UL << HSP_PEVTLR_EVTL_Pos) /*!< 0x01000000 */
#define HSP_PEVTLR_EVTL_25  (0x2000000UL << HSP_PEVTLR_EVTL_Pos) /*!< 0x02000000 */
#define HSP_PEVTLR_EVTL_26  (0x4000000UL << HSP_PEVTLR_EVTL_Pos) /*!< 0x04000000 */
#define HSP_PEVTLR_EVTL_27  (0x8000000UL << HSP_PEVTLR_EVTL_Pos) /*!< 0x08000000 */

/********************  Bit definition for HSP_ITFENR register  ********************/
#define HSP_ITFENR_STREAMEN_Pos (8UL)
#define HSP_ITFENR_STREAMEN_Msk (0x1UL << HSP_ITFENR_STREAMEN_Pos) /*!< 0x00000100 */
#define HSP_ITFENR_STREAMEN     HSP_ITFENR_STREAMEN_Msk            /*!< STREAMEN (STREAMITF enable <sup>(1)</sup>) */

#define HSP_ITFENR_TRGOEN_Pos   (12UL)
#define HSP_ITFENR_TRGOEN_Msk   (0x1UL << HSP_ITFENR_TRGOEN_Pos)   /*!< 0x00001000 */
#define HSP_ITFENR_TRGOEN       HSP_ITFENR_TRGOEN_Msk              /*!< TRGOEN (TRGO enable bit <sup>(1)</sup>) */

#define HSP_ITFENR_TRGI0EN_Pos  (16UL)
#define HSP_ITFENR_TRGI0EN_Msk  (0x1UL << HSP_ITFENR_TRGI0EN_Pos)  /*!< 0x00010000 */
#define HSP_ITFENR_TRGI0EN      HSP_ITFENR_TRGI0EN_Msk             /*!< TRGI0EN (TRGIN0 enable bit <sup>(1)</sup>) */

#define HSP_ITFENR_TRGI1EN_Pos  (17UL)
#define HSP_ITFENR_TRGI1EN_Msk  (0x1UL << HSP_ITFENR_TRGI1EN_Pos)  /*!< 0x00020000 */
#define HSP_ITFENR_TRGI1EN      HSP_ITFENR_TRGI1EN_Msk             /*!< TRGI1EN (TRGIN1 enable bit <sup>(1)</sup>) */

#define HSP_ITFENR_TRGI2EN_Pos  (18UL)
#define HSP_ITFENR_TRGI2EN_Msk  (0x1UL << HSP_ITFENR_TRGI2EN_Pos)  /*!< 0x00040000 */
#define HSP_ITFENR_TRGI2EN      HSP_ITFENR_TRGI2EN_Msk             /*!< TRGI2EN (TRGIN2 enable bit <sup>(1)</sup>) */

