zephyrproject-rtos/hal_stm32/stm32cube/stm32u3xx/soc/stm32u3a6xx.h
#define HSP_TRGINSELR1_TRG6SEL_Pos (16UL)
#define HSP_TRGINSELR1_TRG6SEL_Msk (0x3FUL << HSP_TRGINSELR1_TRG6SEL_Pos) /*!< 0x003F0000 */
#define HSP_TRGINSELR1_TRG6SEL     HSP_TRGINSELR1_TRG6SEL_Msk             /*!< TRG6SEL[5:0] bits (Input trigger selection for TRGIN6) */
#define HSP_TRGINSELR1_TRG6SEL_0   (0x01UL << HSP_TRGINSELR1_TRG6SEL_Pos) /*!< 0x00010000 */
#define HSP_TRGINSELR1_TRG6SEL_1   (0x02UL << HSP_TRGINSELR1_TRG6SEL_Pos) /*!< 0x00020000 */
#define HSP_TRGINSELR1_TRG6SEL_2   (0x04UL << HSP_TRGINSELR1_TRG6SEL_Pos) /*!< 0x00040000 */
#define HSP_TRGINSELR1_TRG6SEL_3   (0x08UL << HSP_TRGINSELR1_TRG6SEL_Pos) /*!< 0x00080000 */
#define HSP_TRGINSELR1_TRG6SEL_4   (0x10UL << HSP_TRGINSELR1_TRG6SEL_Pos) /*!< 0x00100000 */
#define HSP_TRGINSELR1_TRG6SEL_5   (0x20UL << HSP_TRGINSELR1_TRG6SEL_Pos) /*!< 0x00200000 */

#define HSP_TRGINSELR1_TRG7SEL_Pos (24UL)
#define HSP_TRGINSELR1_TRG7SEL_Msk (0x3FUL << HSP_TRGINSELR1_TRG7SEL_Pos) /*!< 0x3F000000 */
#define HSP_TRGINSELR1_TRG7SEL     HSP_TRGINSELR1_TRG7SEL_Msk             /*!< TRG7SEL[5:0] bits (Input trigger selection for TRGIN7) */
#define HSP_TRGINSELR1_TRG7SEL_0   (0x01UL << HSP_TRGINSELR1_TRG7SEL_Pos) /*!< 0x01000000 */
#define HSP_TRGINSELR1_TRG7SEL_1   (0x02UL << HSP_TRGINSELR1_TRG7SEL_Pos) /*!< 0x02000000 */
#define HSP_TRGINSELR1_TRG7SEL_2   (0x04UL << HSP_TRGINSELR1_TRG7SEL_Pos) /*!< 0x04000000 */
#define HSP_TRGINSELR1_TRG7SEL_3   (0x08UL << HSP_TRGINSELR1_TRG7SEL_Pos) /*!< 0x08000000 */
#define HSP_TRGINSELR1_TRG7SEL_4   (0x10UL << HSP_TRGINSELR1_TRG7SEL_Pos) /*!< 0x10000000 */
#define HSP_TRGINSELR1_TRG7SEL_5   (0x20UL << HSP_TRGINSELR1_TRG7SEL_Pos) /*!< 0x20000000 */

/********************  Bit definition for HSP_TRGINSELR2 register  ********************/
#define HSP_TRGINSELR2_TRG8SEL_Pos (0UL)
#define HSP_TRGINSELR2_TRG8SEL_Msk (0x3FUL << HSP_TRGINSELR2_TRG8SEL_Pos) /*!< 0x0000003F */
#define HSP_TRGINSELR2_TRG8SEL     HSP_TRGINSELR2_TRG8SEL_Msk             /*!< TRG8SEL[5:0] bits (Input trigger selection for TRGIN8) */
#define HSP_TRGINSELR2_TRG8SEL_0   (0x01UL << HSP_TRGINSELR2_TRG8SEL_Pos) /*!< 0x00000001 */
#define HSP_TRGINSELR2_TRG8SEL_1   (0x02UL << HSP_TRGINSELR2_TRG8SEL_Pos) /*!< 0x00000002 */
#define HSP_TRGINSELR2_TRG8SEL_2   (0x04UL << HSP_TRGINSELR2_TRG8SEL_Pos) /*!< 0x00000004 */
#define HSP_TRGINSELR2_TRG8SEL_3   (0x08UL << HSP_TRGINSELR2_TRG8SEL_Pos) /*!< 0x00000008 */
#define HSP_TRGINSELR2_TRG8SEL_4   (0x10UL << HSP_TRGINSELR2_TRG8SEL_Pos) /*!< 0x00000010 */
#define HSP_TRGINSELR2_TRG8SEL_5   (0x20UL << HSP_TRGINSELR2_TRG8SEL_Pos) /*!< 0x00000020 */

#define HSP_TRGINSELR2_TRG9SEL_Pos (8UL)
#define HSP_TRGINSELR2_TRG9SEL_Msk (0x3FUL << HSP_TRGINSELR2_TRG9SEL_Pos) /*!< 0x00003F00 */
#define HSP_TRGINSELR2_TRG9SEL     HSP_TRGINSELR2_TRG9SEL_Msk             /*!< TRG9SEL[5:0] bits (Input trigger selection for TRGIN9) */
#define HSP_TRGINSELR2_TRG9SEL_0   (0x01UL << HSP_TRGINSELR2_TRG9SEL_Pos) /*!< 0x00000100 */
#define HSP_TRGINSELR2_TRG9SEL_1   (0x02UL << HSP_TRGINSELR2_TRG9SEL_Pos) /*!< 0x00000200 */
#define HSP_TRGINSELR2_TRG9SEL_2   (0x04UL << HSP_TRGINSELR2_TRG9SEL_Pos) /*!< 0x00000400 */
#define HSP_TRGINSELR2_TRG9SEL_3   (0x08UL << HSP_TRGINSELR2_TRG9SEL_Pos) /*!< 0x00000800 */
#define HSP_TRGINSELR2_TRG9SEL_4   (0x10UL << HSP_TRGINSELR2_TRG9SEL_Pos) /*!< 0x00001000 */
#define HSP_TRGINSELR2_TRG9SEL_5   (0x20UL << HSP_TRGINSELR2_TRG9SEL_Pos) /*!< 0x00002000 */

/********************  Bit definition for HSP_BKOxCFGR register  ********************/
#define HSP_BKOCFGR_ACCEREN_Pos  (0U)
#define HSP_BKOCFGR_ACCEREN_Msk  (0x1UL << HSP_BKOCFGR_ACCEREN_Pos)  /*!< 0x00000001 */
#define HSP_BKOCFGR_ACCEREN      HSP_BKOCFGR_ACCEREN_Msk             /*!< ACCEREN (Access error break enable for ACCERRF <sup>(1)</sup>) */

#define HSP_BKOCFGR_FPUEREN_Pos  (1U)
#define HSP_BKOCFGR_FPUEREN_Msk  (0x1UL << HSP_BKOCFGR_FPUEREN_Pos)  /*!< 0x00000002 */
#define HSP_BKOCFGR_FPUEREN      HSP_BKOCFGR_FPUEREN_Msk             /*!< FPUEREN (FPU error break enable for FPUERRF <sup>(1)</sup>) */

#define HSP_BKOCFGR_OPCEREN_Pos  (2U)
#define HSP_BKOCFGR_OPCEREN_Msk  (0x1UL << HSP_BKOCFGR_OPCEREN_Pos)  /*!< 0x00000004 */
#define HSP_BKOCFGR_OPCEREN      HSP_BKOCFGR_OPCEREN_Msk             /*!< OPCEREN (Opcode error break enable for OPCOERRF ) */

#define HSP_BKOCFGR_PFCT28EN_Pos (4U)
#define HSP_BKOCFGR_PFCT28EN_Msk (0x1UL << HSP_BKOCFGR_PFCT28EN_Pos) /*!< 0x00000010 */
#define HSP_BKOCFGR_PFCT28EN     HSP_BKOCFGR_PFCT28EN_Msk            /*!< PFCT28EN (Processing function flag break enable for PFCTF[28] <sup>(1)</sup>) */

#define HSP_BKOCFGR_PFCT29EN_Pos (5U)
#define HSP_BKOCFGR_PFCT29EN_Msk (0x1UL << HSP_BKOCFGR_PFCT29EN_Pos) /*!< 0x00000020 */
#define HSP_BKOCFGR_PFCT29EN     HSP_BKOCFGR_PFCT29EN_Msk            /*!< PFCT29EN (Processing function flag break enable for PFCTF[29] <sup>(1)</sup>) */

#define HSP_BKOCFGR_PFCT30EN_Pos (6U)
#define HSP_BKOCFGR_PFCT30EN_Msk (0x1UL << HSP_BKOCFGR_PFCT30EN_Pos) /*!< 0x00000040 */
#define HSP_BKOCFGR_PFCT30EN     HSP_BKOCFGR_PFCT30EN_Msk            /*!< PFCT30EN (Processing function flag break enable for PFCTF[30] <sup>(1)</sup>) */

#define HSP_BKOCFGR_PFCT31EN_Pos (7U)
#define HSP_BKOCFGR_PFCT31EN_Msk (0x1UL << HSP_BKOCFGR_PFCT31EN_Pos) /*!< 0x00000080 */
#define HSP_BKOCFGR_PFCT31EN     HSP_BKOCFGR_PFCT31EN_Msk            /*!< PFCT31EN (Processing function flag break enable for PFCTF[31] <sup>(1)</sup>) */

#define HSP_BKOCFGR_FWEREN_Pos   (12U)
#define HSP_BKOCFGR_FWEREN_Msk   (0x1UL << HSP_BKOCFGR_FWEREN_Pos)   /*!< 0x00001000 */
#define HSP_BKOCFGR_FWEREN       HSP_BKOCFGR_FWEREN_Msk              /*!< FWEREN (Firmware error break enable for FWERRF <sup>(1)</sup>) */

#define HSP_BKOCFGR_HDEGOVEN_Pos (13U)
#define HSP_BKOCFGR_HDEGOVEN_Msk (0x1UL << HSP_BKOCFGR_HDEGOVEN_Pos) /*!< 0x00002000 */
#define HSP_BKOCFGR_HDEGOVEN     HSP_BKOCFGR_HDEGOVEN_Msk            /*!< HDEGOVEN (HSP dedicated event generator overrun break enable for HDEGOVRF <sup>(1)</sup>) */

/********************  Bit definition for HSP_BKICFGR register  ********************/
#define HSP_BKICFGR_ACCEREN_Pos  (0UL)
#define HSP_BKICFGR_ACCEREN_Msk  (0x1UL << HSP_BKICFGR_ACCEREN_Pos)  /*!< 0x00000001 */
#define HSP_BKICFGR_ACCEREN      HSP_BKICFGR_ACCEREN_Msk             /*!< ACCEREN (Access error break enable for ACCERRF <sup>(1)</sup>) */

