zephyrproject-rtos/hal_stm32/stm32cube/stm32u3xx/soc/stm32u3a6xx.h
#define HSP_BKICFGR_FPUEREN_Pos  (1UL)
#define HSP_BKICFGR_FPUEREN_Msk  (0x1UL << HSP_BKICFGR_FPUEREN_Pos)  /*!< 0x00000002 */
#define HSP_BKICFGR_FPUEREN      HSP_BKICFGR_FPUEREN_Msk             /*!< FPUEREN (FPU error break enable for FPUERRF <sup>(1)</sup>) */

#define HSP_BKICFGR_OPCEREN_Pos  (2UL)
#define HSP_BKICFGR_OPCEREN_Msk  (0x1UL << HSP_BKICFGR_OPCEREN_Pos)  /*!< 0x00000004 */
#define HSP_BKICFGR_OPCEREN      HSP_BKICFGR_OPCEREN_Msk             /*!< OPCEREN (Opcode error break enable for OPCOERRF ) */

#define HSP_BKICFGR_PFCT28EN_Pos (4UL)
#define HSP_BKICFGR_PFCT28EN_Msk (0x1UL << HSP_BKICFGR_PFCT28EN_Pos) /*!< 0x00000010 */
#define HSP_BKICFGR_PFCT28EN     HSP_BKICFGR_PFCT28EN_Msk            /*!< PFCT28EN (Processing function flag break enable for PFCTF[28] <sup>(1)</sup>) */

#define HSP_BKICFGR_PFCT29EN_Pos (5UL)
#define HSP_BKICFGR_PFCT29EN_Msk (0x1UL << HSP_BKICFGR_PFCT29EN_Pos) /*!< 0x00000020 */
#define HSP_BKICFGR_PFCT29EN     HSP_BKICFGR_PFCT29EN_Msk            /*!< PFCT29EN (Processing function flag break enable for PFCTF[29] <sup>(1)</sup>) */

#define HSP_BKICFGR_PFCT30EN_Pos (6UL)
#define HSP_BKICFGR_PFCT30EN_Msk (0x1UL << HSP_BKICFGR_PFCT30EN_Pos) /*!< 0x00000040 */
#define HSP_BKICFGR_PFCT30EN     HSP_BKICFGR_PFCT30EN_Msk            /*!< PFCT30EN (Processing function flag break enable for PFCTF[30] <sup>(1)</sup>) */

#define HSP_BKICFGR_PFCT31EN_Pos (7UL)
#define HSP_BKICFGR_PFCT31EN_Msk (0x1UL << HSP_BKICFGR_PFCT31EN_Pos) /*!< 0x00000080 */
#define HSP_BKICFGR_PFCT31EN     HSP_BKICFGR_PFCT31EN_Msk            /*!< PFCT31EN (Processing function flag break enable for PFCTF[31] <sup>(1)</sup>) */

#define HSP_BKICFGR_FWEREN_Pos   (12UL)
#define HSP_BKICFGR_FWEREN_Msk   (0x1UL << HSP_BKICFGR_FWEREN_Pos)   /*!< 0x00001000 */
#define HSP_BKICFGR_FWEREN       HSP_BKICFGR_FWEREN_Msk              /*!< FWEREN (Firmware error break enable for FWERRF <sup>(1)</sup>) */

#define HSP_BKICFGR_HDEGOVEN_Pos (13UL)
#define HSP_BKICFGR_HDEGOVEN_Msk (0x1UL << HSP_BKICFGR_HDEGOVEN_Pos) /*!< 0x00002000 */
#define HSP_BKICFGR_HDEGOVEN     HSP_BKICFGR_HDEGOVEN_Msk            /*!< HDEGOVEN (HSP dedicated event generator overrun break enable for HDEGOVRF <sup>(1)</sup>) */

#define HSP_BKICFGR_FSATEN_Pos   (14UL)
#define HSP_BKICFGR_FSATEN_Msk   (0x1UL << HSP_BKICFGR_FSATEN_Pos)   /*!< 0x00004000 */
#define HSP_BKICFGR_FSATEN       HSP_BKICFGR_FSATEN_Msk              /*!< FSATEN (FPU saturation break enable for FPUSATF <sup>(1)</sup>) */

#define HSP_BKICFGR_SSEN_Pos     (17UL)
#define HSP_BKICFGR_SSEN_Msk     (0x1UL << HSP_BKICFGR_SSEN_Pos)     /*!< 0x00020000 */
#define HSP_BKICFGR_SSEN         HSP_BKICFGR_SSEN_Msk                /*!< SSEN (Single step enable <sup>(1)</sup>) */

/********************  Bit definition for HSP_FWERR register  ********************/
#define HSP_FWERR_FWERRN_Pos (0UL)
#define HSP_FWERR_FWERRN_Msk (0x3FFUL << HSP_FWERR_FWERRN_Pos) /*!< 0x000003FF */
#define HSP_FWERR_FWERRN     HSP_FWERR_FWERRN_Msk              /*!< FWERRN[9:0] bits (Firmware error number) */

/********************  Bit definition for HSP_PARAMR0 register  ********************/
/*!< PARAM configuration */
#define HSP_PARAMR0_PARAM_Pos (0UL)
#define HSP_PARAMR0_PARAM_Msk (0xFFFFFFFFUL << HSP_PARAMR0_PARAM_Pos) /*!< 0xFFFFFFFF */
#define HSP_PARAMR0_PARAM     HSP_PARAMR0_PARAM_Msk                   /*!< PARAM[31:0] bits (Parameter value) */

/********************  Bit definition for HSP_PARAMR1 register  ********************/
/*!< PARAM configuration */
#define HSP_PARAMR1_PARAM_Pos (0UL)
#define HSP_PARAMR1_PARAM_Msk (0xFFFFFFFFUL << HSP_PARAMR1_PARAM_Pos) /*!< 0xFFFFFFFF */
#define HSP_PARAMR1_PARAM     HSP_PARAMR1_PARAM_Msk                   /*!< PARAM[31:0] bits (Parameter value) */

/********************  Bit definition for HSP_PARAMR2 register  ********************/
/*!< PARAM configuration */
#define HSP_PARAMR2_PARAM_Pos (0UL)
#define HSP_PARAMR2_PARAM_Msk (0xFFFFFFFFUL << HSP_PARAMR2_PARAM_Pos) /*!< 0xFFFFFFFF */
#define HSP_PARAMR2_PARAM     HSP_PARAMR2_PARAM_Msk                   /*!< PARAM[31:0] bits (Parameter value) */

/********************  Bit definition for HSP_PARAMR3 register  ********************/
/*!< PARAM configuration */
#define HSP_PARAMR3_PARAM_Pos (0UL)
#define HSP_PARAMR3_PARAM_Msk (0xFFFFFFFFUL << HSP_PARAMR3_PARAM_Pos) /*!< 0xFFFFFFFF */
#define HSP_PARAMR3_PARAM     HSP_PARAMR3_PARAM_Msk                   /*!< PARAM[31:0] bits (Parameter value) */

/********************  Bit definition for HSP_PARAMR4 register  ********************/
/*!< PARAM configuration */
#define HSP_PARAMR4_PARAM_Pos (0UL)
#define HSP_PARAMR4_PARAM_Msk (0xFFFFFFFFUL << HSP_PARAMR4_PARAM_Pos) /*!< 0xFFFFFFFF */
#define HSP_PARAMR4_PARAM     HSP_PARAMR4_PARAM_Msk                   /*!< PARAM[31:0] bits (Parameter value) */

/********************  Bit definition for HSP_PARAMR5 register  ********************/
/*!< PARAM configuration */
#define HSP_PARAMR5_PARAM_Pos (0UL)
#define HSP_PARAMR5_PARAM_Msk (0xFFFFFFFFUL << HSP_PARAMR5_PARAM_Pos) /*!< 0xFFFFFFFF */
#define HSP_PARAMR5_PARAM     HSP_PARAMR5_PARAM_Msk                   /*!< PARAM[31:0] bits (Parameter value) */

/********************  Bit definition for HSP_PARAMR6 register  ********************/
/*!< PARAM configuration */
#define HSP_PARAMR6_PARAM_Pos (0UL)
#define HSP_PARAMR6_PARAM_Msk (0xFFFFFFFFUL << HSP_PARAMR6_PARAM_Pos) /*!< 0xFFFFFFFF */
#define HSP_PARAMR6_PARAM     HSP_PARAMR6_PARAM_Msk                   /*!< PARAM[31:0] bits (Parameter value) */

/********************  Bit definition for HSP_PARAMR7 register  ********************/
/*!< PARAM configuration */
#define HSP_PARAMR7_PARAM_Pos (0UL)
#define HSP_PARAMR7_PARAM_Msk (0xFFFFFFFFUL << HSP_PARAMR7_PARAM_Pos) /*!< 0xFFFFFFFF */
#define HSP_PARAMR7_PARAM     HSP_PARAMR7_PARAM_Msk                   /*!< PARAM[31:0] bits (Parameter value) */

/********************  Bit definition for HSP_PARAMR8 register  ********************/
/*!< PARAM configuration */
#define HSP_PARAMR8_PARAM_Pos (0UL)
#define HSP_PARAMR8_PARAM_Msk (0xFFFFFFFFUL << HSP_PARAMR8_PARAM_Pos) /*!< 0xFFFFFFFF */
#define HSP_PARAMR8_PARAM     HSP_PARAMR8_PARAM_Msk                   /*!< PARAM[31:0] bits (Parameter value) */

