zephyrproject-rtos/hal_stm32/stm32cube/stm32u3xx/soc/stm32u3a6xx.h
#define HSP_EVT_IER_EOFWFEIE_Pos   (9UL)
#define HSP_EVT_IER_EOFWFEIE_Msk   (0x1UL << HSP_EVT_IER_EOFWFEIE_Pos)   /*!< 0x00000200 */
#define HSP_EVT_IER_EOFWFEIE       HSP_EVT_IER_EOFWFEIE_Msk              /*!< EOFWFEIE (End of WFE interrupt enable) */

#define HSP_EVT_IER_B0EVTIE_Pos    (12UL)
#define HSP_EVT_IER_B0EVTIE_Msk    (0x1UL << HSP_EVT_IER_B0EVTIE_Pos)    /*!< 0x00001000 */
#define HSP_EVT_IER_B0EVTIE        HSP_EVT_IER_B0EVTIE_Msk               /*!< B0EVTIE (BUFF0 event interrupt enable) */

#define HSP_EVT_IER_B1EVTIE_Pos    (13UL)
#define HSP_EVT_IER_B1EVTIE_Msk    (0x1UL << HSP_EVT_IER_B1EVTIE_Pos)    /*!< 0x00002000 */
#define HSP_EVT_IER_B1EVTIE        HSP_EVT_IER_B1EVTIE_Msk               /*!< B1EVTIE (BUFF1 event interrupt enable) */

#define HSP_EVT_IER_B2EVTIE_Pos    (14UL)
#define HSP_EVT_IER_B2EVTIE_Msk    (0x1UL << HSP_EVT_IER_B2EVTIE_Pos)    /*!< 0x00004000 */
#define HSP_EVT_IER_B2EVTIE        HSP_EVT_IER_B2EVTIE_Msk               /*!< B2EVTIE (BUFF2 event interrupt enable) */

#define HSP_EVT_IER_B3EVTIE_Pos    (15UL)
#define HSP_EVT_IER_B3EVTIE_Msk    (0x1UL << HSP_EVT_IER_B3EVTIE_Pos)    /*!< 0x00008000 */
#define HSP_EVT_IER_B3EVTIE        HSP_EVT_IER_B3EVTIE_Msk               /*!< B3EVTIE (BUFF3 event interrupt enable) */

#define HSP_EVT_IER_SOTECP0IE_Pos  (16UL)
#define HSP_EVT_IER_SOTECP0IE_Msk  (0x1UL << HSP_EVT_IER_SOTECP0IE_Pos)  /*!< 0x00010000 */
#define HSP_EVT_IER_SOTECP0IE      HSP_EVT_IER_SOTECP0IE_Msk             /*!< SOTECP0IE (Start of task generated by event comparator 0 interrupt enable) */

#define HSP_EVT_IER_SOTECP1IE_Pos  (17UL)
#define HSP_EVT_IER_SOTECP1IE_Msk  (0x1UL << HSP_EVT_IER_SOTECP1IE_Pos)  /*!< 0x00020000 */
#define HSP_EVT_IER_SOTECP1IE      HSP_EVT_IER_SOTECP1IE_Msk             /*!< SOTECP1IE (Start of task generated by event comparator 1 interrupt enable) */

#define HSP_EVT_IER_SOTECP2IE_Pos  (18UL)
#define HSP_EVT_IER_SOTECP2IE_Msk  (0x1UL << HSP_EVT_IER_SOTECP2IE_Pos)  /*!< 0x00040000 */
#define HSP_EVT_IER_SOTECP2IE      HSP_EVT_IER_SOTECP2IE_Msk             /*!< SOTECP2IE (Start of task generated by event comparator 2 interrupt enable) */

#define HSP_EVT_IER_SOTECP3IE_Pos  (19UL)
#define HSP_EVT_IER_SOTECP3IE_Msk  (0x1UL << HSP_EVT_IER_SOTECP3IE_Pos)  /*!< 0x00080000 */
#define HSP_EVT_IER_SOTECP3IE      HSP_EVT_IER_SOTECP3IE_Msk             /*!< SOTECP3IE (Start of task generated by event comparator 3 interrupt enable) */

#define HSP_EVT_IER_EOTECP0IE_Pos  (20UL)
#define HSP_EVT_IER_EOTECP0IE_Msk  (0x1UL << HSP_EVT_IER_EOTECP0IE_Pos)  /*!< 0x00100000 */
#define HSP_EVT_IER_EOTECP0IE      HSP_EVT_IER_EOTECP0IE_Msk             /*!< EOTECP0IE (End of task generated by event comparator 0 interrupt enable) */

#define HSP_EVT_IER_EOTECP1IE_Pos  (21UL)
#define HSP_EVT_IER_EOTECP1IE_Msk  (0x1UL << HSP_EVT_IER_EOTECP1IE_Pos)  /*!< 0x00200000 */
#define HSP_EVT_IER_EOTECP1IE      HSP_EVT_IER_EOTECP1IE_Msk             /*!< EOTECP1IE (End of task generated by event comparator 1 interrupt enable) */

#define HSP_EVT_IER_EOTECP2IE_Pos  (22UL)
#define HSP_EVT_IER_EOTECP2IE_Msk  (0x1UL << HSP_EVT_IER_EOTECP2IE_Pos)  /*!< 0x00400000 */
#define HSP_EVT_IER_EOTECP2IE      HSP_EVT_IER_EOTECP2IE_Msk             /*!< EOTECP2IE (End of task generated by event comparator 2 interrupt enable) */

#define HSP_EVT_IER_EOTECP3IE_Pos  (23UL)
#define HSP_EVT_IER_EOTECP3IE_Msk  (0x1UL << HSP_EVT_IER_EOTECP3IE_Pos)  /*!< 0x00800000 */
#define HSP_EVT_IER_EOTECP3IE      HSP_EVT_IER_EOTECP3IE_Msk             /*!< EOTECP3IE (End of task generated by event comparator 3 interrupt enable) */

#define HSP_EVT_IER_TOVLPIE_Pos    (28UL)
#define HSP_EVT_IER_TOVLPIE_Msk    (0x1UL << HSP_EVT_IER_TOVLPIE_Pos)    /*!< 0x10000000 */
#define HSP_EVT_IER_TOVLPIE        HSP_EVT_IER_TOVLPIE_Msk               /*!< TOVLPIE (Task overlap flag interrupt enable) */

#define HSP_EVT_IER_FPUSATIE_Pos   (31UL)
#define HSP_EVT_IER_FPUSATIE_Msk   (0x1UL << HSP_EVT_IER_FPUSATIE_Pos)   /*!< 0x80000000 */
#define HSP_EVT_IER_FPUSATIE       HSP_EVT_IER_FPUSATIE_Msk              /*!< FPUSATIE (Saturation flag interrupt enable) */

/********************  Bit definition for HSP_PFCTEVT_IER register  ********************/
#define HSP_PFCTEVT_IER_PFCTIE_Pos (0UL)
#define HSP_PFCTEVT_IER_PFCTIE_Msk (0xFFFFFFFFUL << HSP_PFCTEVT_IER_PFCTIE_Pos) /*!< 0xFFFFFFFF */
#define HSP_PFCTEVT_IER_PFCTIE     HSP_PFCTEVT_IER_PFCTIE_Msk                   /*!< PFCTIE[31:0] bits (Processing function flags interrupt enable) */
#define HSP_PFCTEVT_IER_PFCTIE_0   (0x00001UL << HSP_PFCTEVT_IER_PFCTIE_Pos)    /*!< 0x00000001 */
#define HSP_PFCTEVT_IER_PFCTIE_1   (0x00002UL << HSP_PFCTEVT_IER_PFCTIE_Pos)    /*!< 0x00000002 */
#define HSP_PFCTEVT_IER_PFCTIE_2   (0x00004UL << HSP_PFCTEVT_IER_PFCTIE_Pos)    /*!< 0x00000004 */
#define HSP_PFCTEVT_IER_PFCTIE_3   (0x00008UL << HSP_PFCTEVT_IER_PFCTIE_Pos)    /*!< 0x00000008 */
#define HSP_PFCTEVT_IER_PFCTIE_4   (0x00010UL << HSP_PFCTEVT_IER_PFCTIE_Pos)    /*!< 0x00000010 */
#define HSP_PFCTEVT_IER_PFCTIE_5   (0x00020UL << HSP_PFCTEVT_IER_PFCTIE_Pos)    /*!< 0x00000020 */
#define HSP_PFCTEVT_IER_PFCTIE_6   (0x00040UL << HSP_PFCTEVT_IER_PFCTIE_Pos)    /*!< 0x00000040 */
#define HSP_PFCTEVT_IER_PFCTIE_7   (0x00080UL << HSP_PFCTEVT_IER_PFCTIE_Pos)    /*!< 0x00000080 */
#define HSP_PFCTEVT_IER_PFCTIE_8   (0x00100UL << HSP_PFCTEVT_IER_PFCTIE_Pos)    /*!< 0x00000100 */
#define HSP_PFCTEVT_IER_PFCTIE_9   (0x00200UL << HSP_PFCTEVT_IER_PFCTIE_Pos)    /*!< 0x00000200 */
#define HSP_PFCTEVT_IER_PFCTIE_10  (0x00400UL << HSP_PFCTEVT_IER_PFCTIE_Pos)    /*!< 0x00000400 */
#define HSP_PFCTEVT_IER_PFCTIE_11  (0x00800UL << HSP_PFCTEVT_IER_PFCTIE_Pos)    /*!< 0x00000800 */
#define HSP_PFCTEVT_IER_PFCTIE_12  (0x01000UL << HSP_PFCTEVT_IER_PFCTIE_Pos)    /*!< 0x00001000 */
#define HSP_PFCTEVT_IER_PFCTIE_13  (0x02000UL << HSP_PFCTEVT_IER_PFCTIE_Pos)    /*!< 0x00002000 */
#define HSP_PFCTEVT_IER_PFCTIE_14  (0x04000UL << HSP_PFCTEVT_IER_PFCTIE_Pos)    /*!< 0x00004000 */
#define HSP_PFCTEVT_IER_PFCTIE_15  (0x08000UL << HSP_PFCTEVT_IER_PFCTIE_Pos)    /*!< 0x00008000 */
#define HSP_PFCTEVT_IER_PFCTIE_16  (0x10000UL << HSP_PFCTEVT_IER_PFCTIE_Pos)    /*!< 0x00010000 */
#define HSP_PFCTEVT_IER_PFCTIE_17  (0x20000UL << HSP_PFCTEVT_IER_PFCTIE_Pos)    /*!< 0x00020000 */
#define HSP_PFCTEVT_IER_PFCTIE_18  (0x40000UL << HSP_PFCTEVT_IER_PFCTIE_Pos)    /*!< 0x00040000 */
#define HSP_PFCTEVT_IER_PFCTIE_19  (0x80000UL << HSP_PFCTEVT_IER_PFCTIE_Pos)    /*!< 0x00080000 */
#define HSP_PFCTEVT_IER_PFCTIE_20  (0x100000UL << HSP_PFCTEVT_IER_PFCTIE_Pos)   /*!< 0x00100000 */
#define HSP_PFCTEVT_IER_PFCTIE_21  (0x200000UL << HSP_PFCTEVT_IER_PFCTIE_Pos)   /*!< 0x00200000 */
#define HSP_PFCTEVT_IER_PFCTIE_22  (0x400000UL << HSP_PFCTEVT_IER_PFCTIE_Pos)   /*!< 0x00400000 */
#define HSP_PFCTEVT_IER_PFCTIE_23  (0x800000UL << HSP_PFCTEVT_IER_PFCTIE_Pos)   /*!< 0x00800000 */
#define HSP_PFCTEVT_IER_PFCTIE_24  (0x1000000UL << HSP_PFCTEVT_IER_PFCTIE_Pos)  /*!< 0x01000000 */
#define HSP_PFCTEVT_IER_PFCTIE_25  (0x2000000UL << HSP_PFCTEVT_IER_PFCTIE_Pos)  /*!< 0x02000000 */
#define HSP_PFCTEVT_IER_PFCTIE_26  (0x4000000UL << HSP_PFCTEVT_IER_PFCTIE_Pos)  /*!< 0x04000000 */
#define HSP_PFCTEVT_IER_PFCTIE_27  (0x8000000UL << HSP_PFCTEVT_IER_PFCTIE_Pos)  /*!< 0x08000000 */
#define HSP_PFCTEVT_IER_PFCTIE_28  (0x10000000UL << HSP_PFCTEVT_IER_PFCTIE_Pos) /*!< 0x10000000 */
#define HSP_PFCTEVT_IER_PFCTIE_29  (0x20000000UL << HSP_PFCTEVT_IER_PFCTIE_Pos) /*!< 0x20000000 */
#define HSP_PFCTEVT_IER_PFCTIE_30  (0x40000000UL << HSP_PFCTEVT_IER_PFCTIE_Pos) /*!< 0x40000000 */
#define HSP_PFCTEVT_IER_PFCTIE_31  (0x80000000UL << HSP_PFCTEVT_IER_PFCTIE_Pos) /*!< 0x80000000 */

/********************  Bit definition for HSP_ERR_ISR register  ********************/
#define HSP_ERR_ISR_TRGIOVRF_Pos (8UL)
#define HSP_ERR_ISR_TRGIOVRF_Msk (0x1UL << HSP_ERR_ISR_TRGIOVRF_Pos) /*!< 0x00000100 */
#define HSP_ERR_ISR_TRGIOVRF     HSP_ERR_ISR_TRGIOVRF_Msk            /*!< TRGIOVRF (TRGITF overrun flag) */

