zephyrproject-rtos/hal_stm32/stm32cube/stm32u3xx/soc/stm32u3a6xx.h
#define HSP_EVT_ICR_SOTECP3C_Pos  (19UL)
#define HSP_EVT_ICR_SOTECP3C_Msk  (0x1UL << HSP_EVT_ICR_SOTECP3C_Pos)  /*!< 0x00080000 */
#define HSP_EVT_ICR_SOTECP3C      HSP_EVT_ICR_SOTECP3C_Msk             /*!< SOTECP3C (Clear SOTECP3F flag) */

#define HSP_EVT_ICR_EOTECP0C_Pos  (20UL)
#define HSP_EVT_ICR_EOTECP0C_Msk  (0x1UL << HSP_EVT_ICR_EOTECP0C_Pos)  /*!< 0x00100000 */
#define HSP_EVT_ICR_EOTECP0C      HSP_EVT_ICR_EOTECP0C_Msk             /*!< EOTECP0C (Clear EOTECP0F flag) */

#define HSP_EVT_ICR_EOTECP1C_Pos  (21UL)
#define HSP_EVT_ICR_EOTECP1C_Msk  (0x1UL << HSP_EVT_ICR_EOTECP1C_Pos)  /*!< 0x00200000 */
#define HSP_EVT_ICR_EOTECP1C      HSP_EVT_ICR_EOTECP1C_Msk             /*!< EOTECP1C (Clear EOTECP1F flag) */

#define HSP_EVT_ICR_EOTECP2C_Pos  (22UL)
#define HSP_EVT_ICR_EOTECP2C_Msk  (0x1UL << HSP_EVT_ICR_EOTECP2C_Pos)  /*!< 0x00400000 */
#define HSP_EVT_ICR_EOTECP2C      HSP_EVT_ICR_EOTECP2C_Msk             /*!< EOTECP2C (Clear EOTECP2F flag) */

#define HSP_EVT_ICR_EOTECP3C_Pos  (23UL)
#define HSP_EVT_ICR_EOTECP3C_Msk  (0x1UL << HSP_EVT_ICR_EOTECP3C_Pos)  /*!< 0x00800000 */
#define HSP_EVT_ICR_EOTECP3C      HSP_EVT_ICR_EOTECP3C_Msk             /*!< EOTECP3C (Clear EOTECP3F flag) */

#define HSP_EVT_ICR_TOVLPC_Pos    (28UL)
#define HSP_EVT_ICR_TOVLPC_Msk    (0x1UL << HSP_EVT_ICR_TOVLPC_Pos)    /*!< 0x10000000 */
#define HSP_EVT_ICR_TOVLPC        HSP_EVT_ICR_TOVLPC_Msk               /*!< TOVLPC (Clear TOVLPF flag) */

#define HSP_EVT_ICR_FPUSATC_Pos   (31UL)
#define HSP_EVT_ICR_FPUSATC_Msk   (0x1UL << HSP_EVT_ICR_FPUSATC_Pos)   /*!< 0x80000000 */
#define HSP_EVT_ICR_FPUSATC       HSP_EVT_ICR_FPUSATC_Msk              /*!< FPUSATC (Clear FPUSATF flag) */

/********************  Bit definition for HSP_PFCTEVT_ICR register  ********************/
#define HSP_PFCTEVT_ICR_PFCTC_Pos (0UL)
#define HSP_PFCTEVT_ICR_PFCTC_Msk (0xFFFFFFFFUL << HSP_PFCTEVT_ICR_PFCTC_Pos) /*!< 0xFFFFFFFF */
#define HSP_PFCTEVT_ICR_PFCTC     HSP_PFCTEVT_ICR_PFCTC_Msk                   /*!< PFCTC[31:0] bits (Clear PFCTF[31:0] flag) */
#define HSP_PFCTEVT_ICR_PFCTC_0   (0x00001UL << HSP_PFCTEVT_ICR_PFCTC_Pos)    /*!< 0x00000001 */
#define HSP_PFCTEVT_ICR_PFCTC_1   (0x00002UL << HSP_PFCTEVT_ICR_PFCTC_Pos)    /*!< 0x00000002 */
#define HSP_PFCTEVT_ICR_PFCTC_2   (0x00004UL << HSP_PFCTEVT_ICR_PFCTC_Pos)    /*!< 0x00000004 */
#define HSP_PFCTEVT_ICR_PFCTC_3   (0x00008UL << HSP_PFCTEVT_ICR_PFCTC_Pos)    /*!< 0x00000008 */
#define HSP_PFCTEVT_ICR_PFCTC_4   (0x00010UL << HSP_PFCTEVT_ICR_PFCTC_Pos)    /*!< 0x00000010 */
#define HSP_PFCTEVT_ICR_PFCTC_5   (0x00020UL << HSP_PFCTEVT_ICR_PFCTC_Pos)    /*!< 0x00000020 */
#define HSP_PFCTEVT_ICR_PFCTC_6   (0x00040UL << HSP_PFCTEVT_ICR_PFCTC_Pos)    /*!< 0x00000040 */
#define HSP_PFCTEVT_ICR_PFCTC_7   (0x00080UL << HSP_PFCTEVT_ICR_PFCTC_Pos)    /*!< 0x00000080 */
#define HSP_PFCTEVT_ICR_PFCTC_8   (0x00100UL << HSP_PFCTEVT_ICR_PFCTC_Pos)    /*!< 0x00000100 */
#define HSP_PFCTEVT_ICR_PFCTC_9   (0x00200UL << HSP_PFCTEVT_ICR_PFCTC_Pos)    /*!< 0x00000200 */
#define HSP_PFCTEVT_ICR_PFCTC_10  (0x00400UL << HSP_PFCTEVT_ICR_PFCTC_Pos)    /*!< 0x00000400 */
#define HSP_PFCTEVT_ICR_PFCTC_11  (0x00800UL << HSP_PFCTEVT_ICR_PFCTC_Pos)    /*!< 0x00000800 */
#define HSP_PFCTEVT_ICR_PFCTC_12  (0x01000UL << HSP_PFCTEVT_ICR_PFCTC_Pos)    /*!< 0x00001000 */
#define HSP_PFCTEVT_ICR_PFCTC_13  (0x02000UL << HSP_PFCTEVT_ICR_PFCTC_Pos)    /*!< 0x00002000 */
#define HSP_PFCTEVT_ICR_PFCTC_14  (0x04000UL << HSP_PFCTEVT_ICR_PFCTC_Pos)    /*!< 0x00004000 */
#define HSP_PFCTEVT_ICR_PFCTC_15  (0x08000UL << HSP_PFCTEVT_ICR_PFCTC_Pos)    /*!< 0x00008000 */
#define HSP_PFCTEVT_ICR_PFCTC_16  (0x10000UL << HSP_PFCTEVT_ICR_PFCTC_Pos)    /*!< 0x00010000 */
#define HSP_PFCTEVT_ICR_PFCTC_17  (0x20000UL << HSP_PFCTEVT_ICR_PFCTC_Pos)    /*!< 0x00020000 */
#define HSP_PFCTEVT_ICR_PFCTC_18  (0x40000UL << HSP_PFCTEVT_ICR_PFCTC_Pos)    /*!< 0x00040000 */
#define HSP_PFCTEVT_ICR_PFCTC_19  (0x80000UL << HSP_PFCTEVT_ICR_PFCTC_Pos)    /*!< 0x00080000 */
#define HSP_PFCTEVT_ICR_PFCTC_20  (0x100000UL << HSP_PFCTEVT_ICR_PFCTC_Pos)   /*!< 0x00100000 */
#define HSP_PFCTEVT_ICR_PFCTC_21  (0x200000UL << HSP_PFCTEVT_ICR_PFCTC_Pos)   /*!< 0x00200000 */
#define HSP_PFCTEVT_ICR_PFCTC_22  (0x400000UL << HSP_PFCTEVT_ICR_PFCTC_Pos)   /*!< 0x00400000 */
#define HSP_PFCTEVT_ICR_PFCTC_23  (0x800000UL << HSP_PFCTEVT_ICR_PFCTC_Pos)   /*!< 0x00800000 */
#define HSP_PFCTEVT_ICR_PFCTC_24  (0x1000000UL << HSP_PFCTEVT_ICR_PFCTC_Pos)  /*!< 0x01000000 */
#define HSP_PFCTEVT_ICR_PFCTC_25  (0x2000000UL << HSP_PFCTEVT_ICR_PFCTC_Pos)  /*!< 0x02000000 */
#define HSP_PFCTEVT_ICR_PFCTC_26  (0x4000000UL << HSP_PFCTEVT_ICR_PFCTC_Pos)  /*!< 0x04000000 */
#define HSP_PFCTEVT_ICR_PFCTC_27  (0x8000000UL << HSP_PFCTEVT_ICR_PFCTC_Pos)  /*!< 0x08000000 */
#define HSP_PFCTEVT_ICR_PFCTC_28  (0x10000000UL << HSP_PFCTEVT_ICR_PFCTC_Pos) /*!< 0x10000000 */
#define HSP_PFCTEVT_ICR_PFCTC_29  (0x20000000UL << HSP_PFCTEVT_ICR_PFCTC_Pos) /*!< 0x20000000 */
#define HSP_PFCTEVT_ICR_PFCTC_30  (0x40000000UL << HSP_PFCTEVT_ICR_PFCTC_Pos) /*!< 0x40000000 */
#define HSP_PFCTEVT_ICR_PFCTC_31  (0x80000000UL << HSP_PFCTEVT_ICR_PFCTC_Pos) /*!< 0x80000000 */

/********************  Bit definition for HSP_FWVERR register  ********************/
#define HSP_FWVERR_CRAMINREV_Pos (0UL)
#define HSP_FWVERR_CRAMINREV_Msk (0xFFUL << HSP_FWVERR_CRAMINREV_Pos) /*!< 0x000000FF */
#define HSP_FWVERR_CRAMINREV     HSP_FWVERR_CRAMINREV_Msk             /*!< CRAMINREV[7:0] bits (Code RAM Minor revision) */

#define HSP_FWVERR_CRAMAJREV_Pos (8UL)
#define HSP_FWVERR_CRAMAJREV_Msk (0xFUL << HSP_FWVERR_CRAMAJREV_Pos)  /*!< 0x00000F00 */
#define HSP_FWVERR_CRAMAJREV     HSP_FWVERR_CRAMAJREV_Msk             /*!< CRAMAJREV[3:0] bits (Code RAM Major revision) */

#define HSP_FWVERR_CROMINREV_Pos (12UL)
#define HSP_FWVERR_CROMINREV_Msk (0xFFUL << HSP_FWVERR_CROMINREV_Pos)  /*!< 0x000FF000 */
#define HSP_FWVERR_CROMINREV     HSP_FWVERR_CROMINREV_Msk             /*!< CROMINREV[7:0] bits (Code ROM Minor revision) */

#define HSP_FWVERR_CROMAJREV_Pos (20UL)
#define HSP_FWVERR_CROMAJREV_Msk (0xFUL << HSP_FWVERR_CROMAJREV_Pos)  /*!< 0x000F0000 */
#define HSP_FWVERR_CROMAJREV     HSP_FWVERR_CROMAJREV_Msk             /*!< CROMAJREV[3:0] bits (Code ROM Major revision) */

#define HSP_FWVERR_DROMINREV_Pos (24UL)
#define HSP_FWVERR_DROMINREV_Msk (0xFUL << HSP_FWVERR_DROMINREV_Pos)  /*!< 0x00F00000 */
#define HSP_FWVERR_DROMINREV     HSP_FWVERR_DROMINREV_Msk             /*!< DROMINREV[3:0] bits (Data ROM Minor revision) */

#define HSP_FWVERR_DROMAJREV_Pos (28UL)
#define HSP_FWVERR_DROMAJREV_Msk (0xFUL << HSP_FWVERR_DROMAJREV_Pos)  /*!< 0x0F000000 */
#define HSP_FWVERR_DROMAJREV     HSP_FWVERR_DROMAJREV_Msk             /*!< DROMAJREV[3:0] bits (Data ROM Major revision) */

/******************************************************************************/
/*                                                                            */
/*                      Inter-integrated Circuit Interface (I2C)              */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for I2C_CR1 register  *******************/
#define I2C_CR1_PE_Pos                      (0UL)
#define I2C_CR1_PE_Msk                      (0x1UL << I2C_CR1_PE_Pos)               /*!< 0x00000001 */
#define I2C_CR1_PE                          I2C_CR1_PE_Msk                          /*!< Peripheral enable */
#define I2C_CR1_TXIE_Pos                    (1UL)
#define I2C_CR1_TXIE_Msk                    (0x1UL << I2C_CR1_TXIE_Pos)             /*!< 0x00000002 */
#define I2C_CR1_TXIE                        I2C_CR1_TXIE_Msk                        /*!< TX interrupt enable */
#define I2C_CR1_RXIE_Pos                    (2UL)
#define I2C_CR1_RXIE_Msk                    (0x1UL << I2C_CR1_RXIE_Pos)             /*!< 0x00000004 */
#define I2C_CR1_RXIE                        I2C_CR1_RXIE_Msk                        /*!< RX interrupt enable */
#define I2C_CR1_ADDRIE_Pos                  (3UL)
#define I2C_CR1_ADDRIE_Msk                  (0x1UL << I2C_CR1_ADDRIE_Pos)           /*!< 0x00000008 */
#define I2C_CR1_ADDRIE                      I2C_CR1_ADDRIE_Msk                      /*!< Address match interrupt enable */
#define I2C_CR1_NACKIE_Pos                  (4UL)
#define I2C_CR1_NACKIE_Msk                  (0x1UL << I2C_CR1_NACKIE_Pos)           /*!< 0x00000010 */
#define I2C_CR1_NACKIE                      I2C_CR1_NACKIE_Msk                      /*!< NACK received interrupt enable */
#define I2C_CR1_STOPIE_Pos                  (5UL)
#define I2C_CR1_STOPIE_Msk                  (0x1UL << I2C_CR1_STOPIE_Pos)           /*!< 0x00000020 */
#define I2C_CR1_STOPIE                      I2C_CR1_STOPIE_Msk                      /*!< STOP detection interrupt enable */
#define I2C_CR1_TCIE_Pos                    (6UL)
#define I2C_CR1_TCIE_Msk                    (0x1UL << I2C_CR1_TCIE_Pos)             /*!< 0x00000040 */
#define I2C_CR1_TCIE                        I2C_CR1_TCIE_Msk                        /*!< Transfer complete interrupt enable */
#define I2C_CR1_ERRIE_Pos                   (7UL)
#define I2C_CR1_ERRIE_Msk                   (0x1UL << I2C_CR1_ERRIE_Pos)            /*!< 0x00000080 */
#define I2C_CR1_ERRIE                       I2C_CR1_ERRIE_Msk                       /*!< Errors interrupt enable */
#define I2C_CR1_DNF_Pos                     (8UL)
#define I2C_CR1_DNF_Msk                     (0xFUL << I2C_CR1_DNF_Pos)              /*!< 0x00000F00 */
#define I2C_CR1_DNF                         I2C_CR1_DNF_Msk                         /*!< Digital noise filter */
#define I2C_CR1_ANFOFF_Pos                  (12UL)
#define I2C_CR1_ANFOFF_Msk                  (0x1UL << I2C_CR1_ANFOFF_Pos)           /*!< 0x00001000 */
#define I2C_CR1_ANFOFF                      I2C_CR1_ANFOFF_Msk                      /*!< Analog noise filter OFF */
#define I2C_CR1_SWRST_Pos                   (13UL)
#define I2C_CR1_SWRST_Msk                   (0x1UL << I2C_CR1_SWRST_Pos)            /*!< 0x00002000 */
#define I2C_CR1_SWRST                       I2C_CR1_SWRST_Msk                       /*!< Software reset */
#define I2C_CR1_TXDMAEN_Pos                 (14UL)
#define I2C_CR1_TXDMAEN_Msk                 (0x1UL << I2C_CR1_TXDMAEN_Pos)          /*!< 0x00004000 */
#define I2C_CR1_TXDMAEN                     I2C_CR1_TXDMAEN_Msk                     /*!< DMA transmission requests enable */
#define I2C_CR1_RXDMAEN_Pos                 (15UL)
#define I2C_CR1_RXDMAEN_Msk                 (0x1UL << I2C_CR1_RXDMAEN_Pos)          /*!< 0x00008000 */
#define I2C_CR1_RXDMAEN                     I2C_CR1_RXDMAEN_Msk                     /*!< DMA reception requests enable */
#define I2C_CR1_SBC_Pos                     (16UL)
#define I2C_CR1_SBC_Msk                     (0x1UL << I2C_CR1_SBC_Pos)              /*!< 0x00010000 */
#define I2C_CR1_SBC                         I2C_CR1_SBC_Msk                         /*!< Slave byte control */
#define I2C_CR1_NOSTRETCH_Pos               (17UL)
#define I2C_CR1_NOSTRETCH_Msk               (0x1UL << I2C_CR1_NOSTRETCH_Pos)        /*!< 0x00020000 */
#define I2C_CR1_NOSTRETCH                   I2C_CR1_NOSTRETCH_Msk                   /*!< Clock stretching disable */
#define I2C_CR1_WUPEN_Pos                   (18UL)
#define I2C_CR1_WUPEN_Msk                   (0x1UL << I2C_CR1_WUPEN_Pos)            /*!< 0x00040000 */
#define I2C_CR1_WUPEN                       I2C_CR1_WUPEN_Msk                       /*!< Wakeup from STOP enable */
#define I2C_CR1_GCEN_Pos                    (19UL)
#define I2C_CR1_GCEN_Msk                    (0x1UL << I2C_CR1_GCEN_Pos)             /*!< 0x00080000 */
#define I2C_CR1_GCEN                        I2C_CR1_GCEN_Msk                        /*!< General call enable */
#define I2C_CR1_SMBHEN_Pos                  (20UL)
#define I2C_CR1_SMBHEN_Msk                  (0x1UL << I2C_CR1_SMBHEN_Pos)           /*!< 0x00100000 */
#define I2C_CR1_SMBHEN                      I2C_CR1_SMBHEN_Msk                      /*!< SMBus host address enable */
#define I2C_CR1_SMBDEN_Pos                  (21UL)
#define I2C_CR1_SMBDEN_Msk                  (0x1UL << I2C_CR1_SMBDEN_Pos)           /*!< 0x00200000 */
#define I2C_CR1_SMBDEN                      I2C_CR1_SMBDEN_Msk                      /*!< SMBus device default address enable */
#define I2C_CR1_ALERTEN_Pos                 (22UL)
#define I2C_CR1_ALERTEN_Msk                 (0x1UL << I2C_CR1_ALERTEN_Pos)          /*!< 0x00400000 */
#define I2C_CR1_ALERTEN                     I2C_CR1_ALERTEN_Msk                     /*!< SMBus alert enable */
#define I2C_CR1_PECEN_Pos                   (23UL)
#define I2C_CR1_PECEN_Msk                   (0x1UL << I2C_CR1_PECEN_Pos)            /*!< 0x00800000 */
#define I2C_CR1_PECEN                       I2C_CR1_PECEN_Msk                       /*!< PEC enable */
#define I2C_CR1_FMP_Pos                     (24UL)
#define I2C_CR1_FMP_Msk                     (0x1UL << I2C_CR1_FMP_Pos)              /*!< 0x01000000 */
#define I2C_CR1_FMP                         I2C_CR1_FMP_Msk                         /*!< FMP enable */
#define I2C_CR1_ADDRACLR_Pos                (30UL)
#define I2C_CR1_ADDRACLR_Msk                (0x1UL << I2C_CR1_ADDRACLR_Pos)         /*!< 0x40000000 */
#define I2C_CR1_ADDRACLR                    I2C_CR1_ADDRACLR_Msk                    /*!< ADDRACLR enable */
#define I2C_CR1_STOPFACLR_Pos               (31UL)
#define I2C_CR1_STOPFACLR_Msk               (0x1UL << I2C_CR1_STOPFACLR_Pos)        /*!< 0x80000000 */
#define I2C_CR1_STOPFACLR                   I2C_CR1_STOPFACLR_Msk                   /*!< STOPFACLR enable */

/******************  Bit definition for I2C_CR2 register  ********************/
#define I2C_CR2_SADD_Pos                    (0UL)
#define I2C_CR2_SADD_Msk                    (0x3FFUL << I2C_CR2_SADD_Pos)           /*!< 0x000003FF */
#define I2C_CR2_SADD                        I2C_CR2_SADD_Msk                        /*!< Slave address (master mode) */
#define I2C_CR2_RD_WRN_Pos                  (10UL)
#define I2C_CR2_RD_WRN_Msk                  (0x1UL << I2C_CR2_RD_WRN_Pos)           /*!< 0x00000400 */
#define I2C_CR2_RD_WRN                      I2C_CR2_RD_WRN_Msk                      /*!< Transfer direction (master mode) */
#define I2C_CR2_ADD10_Pos                   (11UL)
#define I2C_CR2_ADD10_Msk                   (0x1UL << I2C_CR2_ADD10_Pos)            /*!< 0x00000800 */
#define I2C_CR2_ADD10                       I2C_CR2_ADD10_Msk                       /*!< 10-bit addressing mode (master mode) */
#define I2C_CR2_HEAD10R_Pos                 (12UL)
#define I2C_CR2_HEAD10R_Msk                 (0x1UL << I2C_CR2_HEAD10R_Pos)          /*!< 0x00001000 */
#define I2C_CR2_HEAD10R                     I2C_CR2_HEAD10R_Msk                     /*!< 10-bit address header only read direction (master mode) */
#define I2C_CR2_START_Pos                   (13UL)
#define I2C_CR2_START_Msk                   (0x1UL << I2C_CR2_START_Pos)            /*!< 0x00002000 */
#define I2C_CR2_START                       I2C_CR2_START_Msk                       /*!< START generation */
#define I2C_CR2_STOP_Pos                    (14UL)
#define I2C_CR2_STOP_Msk                    (0x1UL << I2C_CR2_STOP_Pos)             /*!< 0x00004000 */
#define I2C_CR2_STOP                        I2C_CR2_STOP_Msk                        /*!< STOP generation (master mode) */
#define I2C_CR2_NACK_Pos                    (15UL)
#define I2C_CR2_NACK_Msk                    (0x1UL << I2C_CR2_NACK_Pos)             /*!< 0x00008000 */
#define I2C_CR2_NACK                        I2C_CR2_NACK_Msk                        /*!< NACK generation (slave mode) */
#define I2C_CR2_NBYTES_Pos                  (16UL)
#define I2C_CR2_NBYTES_Msk                  (0xFFUL << I2C_CR2_NBYTES_Pos)          /*!< 0x00FF0000 */
#define I2C_CR2_NBYTES                      I2C_CR2_NBYTES_Msk                      /*!< Number of bytes */
#define I2C_CR2_RELOAD_Pos                  (24UL)
#define I2C_CR2_RELOAD_Msk                  (0x1UL << I2C_CR2_RELOAD_Pos)           /*!< 0x01000000 */
#define I2C_CR2_RELOAD                      I2C_CR2_RELOAD_Msk                      /*!< NBYTES reload mode */
#define I2C_CR2_AUTOEND_Pos                 (25UL)
#define I2C_CR2_AUTOEND_Msk                 (0x1UL << I2C_CR2_AUTOEND_Pos)          /*!< 0x02000000 */
#define I2C_CR2_AUTOEND                     I2C_CR2_AUTOEND_Msk                     /*!< Automatic end mode (master mode) */
#define I2C_CR2_PECBYTE_Pos                 (26UL)
#define I2C_CR2_PECBYTE_Msk                 (0x1UL << I2C_CR2_PECBYTE_Pos)          /*!< 0x04000000 */
#define I2C_CR2_PECBYTE                     I2C_CR2_PECBYTE_Msk                     /*!< Packet error checking byte */

/*******************  Bit definition for I2C_OAR1 register  ******************/
#define I2C_OAR1_OA1_Pos                    (0UL)
#define I2C_OAR1_OA1_Msk                    (0x3FFUL << I2C_OAR1_OA1_Pos)           /*!< 0x000003FF */
#define I2C_OAR1_OA1                        I2C_OAR1_OA1_Msk                        /*!< Interface own address 1 */
#define I2C_OAR1_OA1MODE_Pos                (10UL)
#define I2C_OAR1_OA1MODE_Msk                (0x1UL << I2C_OAR1_OA1MODE_Pos)         /*!< 0x00000400 */
#define I2C_OAR1_OA1MODE                    I2C_OAR1_OA1MODE_Msk                    /*!< Own address 1 10-bit mode */
#define I2C_OAR1_OA1EN_Pos                  (15UL)
#define I2C_OAR1_OA1EN_Msk                  (0x1UL << I2C_OAR1_OA1EN_Pos)           /*!< 0x00008000 */
#define I2C_OAR1_OA1EN                      I2C_OAR1_OA1EN_Msk                      /*!< Own address 1 enable */

