zephyrproject-rtos/hal_stm32/stm32cube/stm32u3xx/soc/stm32u3a6xx.h
/******************************************************************************/
/*                                                                            */
/*                         Reset and Clock Control                            */
/*                                                                            */
/******************************************************************************/
/********************  Bit definition for RCC_CR register  ********************/
#define RCC_CR_MSISON_Pos                   (0UL)
#define RCC_CR_MSISON_Msk                   (0x1UL << RCC_CR_MSISON_Pos)            /*!< 0x00000001 */
#define RCC_CR_MSISON                       RCC_CR_MSISON_Msk                       /*!< Internal Multi Speed Oscillator System (MSIS) Clock Enable */
#define RCC_CR_MSIKERON_Pos                 (1UL)
#define RCC_CR_MSIKERON_Msk                 (0x1UL << RCC_CR_MSIKERON_Pos)          /*!< 0x00000002 */
#define RCC_CR_MSIKERON                     RCC_CR_MSIKERON_Msk                     /*!< MSI Enable for some peripheral Kernels */
#define RCC_CR_MSISRDY_Pos                  (2UL)
#define RCC_CR_MSISRDY_Msk                  (0x1UL << RCC_CR_MSISRDY_Pos)           /*!< 0x00000004 */
#define RCC_CR_MSISRDY                      RCC_CR_MSISRDY_Msk                      /*!< Internal Multi Speed Oscillator System (MSIS) Clock Ready Flag */
#define RCC_CR_MSIKON_Pos                   (3UL)
#define RCC_CR_MSIKON_Msk                   (0x1UL << RCC_CR_MSIKON_Pos)            /*!< 0x00000008 */
#define RCC_CR_MSIKON                       RCC_CR_MSIKON_Msk                       /*!< Internal Multi Speed Oscillator Kernel (MSIK) Enable */
#define RCC_CR_MSIKRDY_Pos                  (4UL)
#define RCC_CR_MSIKRDY_Msk                  (0x1UL << RCC_CR_MSIKRDY_Pos)           /*!< 0x00000010 */
#define RCC_CR_MSIKRDY                      RCC_CR_MSIKRDY_Msk                      /*!< Internal Multi Speed Oscillator Kernel (MSIK) Ready Flag */
#define RCC_CR_MSIPLL1EN_Pos                (5UL)
#define RCC_CR_MSIPLL1EN_Msk                (0x1UL << RCC_CR_MSIPLL1EN_Pos)         /*!< 0x00000020 */
#define RCC_CR_MSIPLL1EN                     RCC_CR_MSIPLL1EN_Msk                   /*!< MSIRC1 PLL-mode enable */
#define RCC_CR_MSIPLL0EN_Pos                (6UL)
#define RCC_CR_MSIPLL0EN_Msk                (0x1UL << RCC_CR_MSIPLL0EN_Pos)         /*!< 0x00000040 */
#define RCC_CR_MSIPLL0EN                    RCC_CR_MSIPLL0EN_Msk                    /*!< MSIRC0 PLL-mode enable */
#define RCC_CR_MSIPLL1FAST_Pos              (7UL)
#define RCC_CR_MSIPLL1FAST_Msk              (0x1UL << RCC_CR_MSIPLL1FAST_Pos)       /*!< 0x00000080 */
#define RCC_CR_MSIPLL1FAST                  RCC_CR_MSIPLL1FAST_Msk                  /*!< MSIRC1 PLL-mode fast startup */
#define RCC_CR_MSIPLL0FAST_Pos              (8UL)
#define RCC_CR_MSIPLL0FAST_Msk              (0x1UL << RCC_CR_MSIPLL0FAST_Pos)       /*!< 0x00000100 */
#define RCC_CR_MSIPLL0FAST                  RCC_CR_MSIPLL0FAST_Msk                  /*!< MSIRC0 PLL-mode fast startup */
#define RCC_CR_MSIPLL1RDY_Pos               (9UL)
#define RCC_CR_MSIPLL1RDY_Msk               (0x1UL << RCC_CR_MSIPLL1RDY_Pos)        /*!< 0x00000200 */
#define RCC_CR_MSIPLL1RDY                   RCC_CR_MSIPLL1RDY_Msk                   /*!< MSIRC1 PLL-mode ready flag */
#define RCC_CR_MSIPLL0RDY_Pos               (10UL)
#define RCC_CR_MSIPLL0RDY_Msk               (0x1UL << RCC_CR_MSIPLL0RDY_Pos)        /*!< 0x00000400 */
#define RCC_CR_MSIPLL0RDY                   RCC_CR_MSIPLL0RDY_Msk                   /*!< MSIRC0 PLL-mode ready flag */
#define RCC_CR_HSION_Pos                    (11UL)
#define RCC_CR_HSION_Msk                    (0x1UL << RCC_CR_HSION_Pos)             /*!< 0x00000800 */
#define RCC_CR_HSION                        RCC_CR_HSION_Msk                        /*!< Internal High Speed Oscillator (HSI16) Clock Enable */
#define RCC_CR_HSIKERON_Pos                 (12UL)
#define RCC_CR_HSIKERON_Msk                 (0x1UL << RCC_CR_HSIKERON_Pos)          /*!< 0x00001000 */
#define RCC_CR_HSIKERON                     RCC_CR_HSIKERON_Msk                     /*!< Internal High Speed Oscillator (HSI16) Clock Enable for some peripheral Kernels */
#define RCC_CR_HSIRDY_Pos                   (13UL)
#define RCC_CR_HSIRDY_Msk                   (0x1UL << RCC_CR_HSIRDY_Pos)            /*!< 0x00002000 */
#define RCC_CR_HSIRDY                       RCC_CR_HSIRDY_Msk                       /*!< Internal High Speed Oscillator (HSI16) Clock Ready Flag */
#define RCC_CR_HSI48ON_Pos                  (14UL)
#define RCC_CR_HSI48ON_Msk                  (0x1UL << RCC_CR_HSI48ON_Pos)           /*!< 0x00004000 */
#define RCC_CR_HSI48ON                      RCC_CR_HSI48ON_Msk                      /*!< Internal High Speed Oscillator (HSI48) Clock Enable */
#define RCC_CR_HSI48RDY_Pos                 (15UL)
#define RCC_CR_HSI48RDY_Msk                 (0x1UL << RCC_CR_HSI48RDY_Pos)          /*!< 0x00008000 */
#define RCC_CR_HSI48RDY                     RCC_CR_HSI48RDY_Msk                     /*!< Internal High Speed Oscillator (HSI48) Clock Ready Flag */
#define RCC_CR_HSEON_Pos                    (16UL)
#define RCC_CR_HSEON_Msk                    (0x1UL << RCC_CR_HSEON_Pos)             /*!< 0x00010000 */
#define RCC_CR_HSEON                        RCC_CR_HSEON_Msk                        /*!< External High Speed Oscillator (HSE) Clock Enable */
#define RCC_CR_HSERDY_Pos                   (17UL)
#define RCC_CR_HSERDY_Msk                   (0x1UL << RCC_CR_HSERDY_Pos)            /*!< 0x00020000 */
#define RCC_CR_HSERDY                       RCC_CR_HSERDY_Msk                       /*!< External High Speed Oscillator (HSE) Clock Ready */
#define RCC_CR_HSEBYP_Pos                   (18UL)
#define RCC_CR_HSEBYP_Msk                   (0x1UL << RCC_CR_HSEBYP_Pos)            /*!< 0x00040000 */
#define RCC_CR_HSEBYP                       RCC_CR_HSEBYP_Msk                       /*!< External High Speed Oscillator (HSE) Crystal Oscillator Bypass */
#define RCC_CR_HSECSSON_Pos                 (19UL)
#define RCC_CR_HSECSSON_Msk                 (0x1UL << RCC_CR_HSECSSON_Pos)          /*!< 0x00080000 */
#define RCC_CR_HSECSSON                     RCC_CR_HSECSSON_Msk                     /*!< External High Speed Oscillator (HSE) Clock Security System Enable */
#define RCC_CR_HSEEXT_Pos                   (20UL)
#define RCC_CR_HSEEXT_Msk                   (0x1UL << RCC_CR_HSEEXT_Pos)            /*!< 0x00100000 */
#define RCC_CR_HSEEXT                       RCC_CR_HSEEXT_Msk                       /*!< External High Speed Oscillator (HSE) External Clock Bypass Mode */

